[
{"link":"https://coinmarketcap.com/academy/article/operation-choke-point-2.0-the-third-crypto-war","websiteSource":"CoinMarketCap","type":"article","summary":"Increased regulations and uncertainty is prompting some industry experts to call the crypto crackdown \"Operation Choke Point 2.0.\" Could a third crypto war be underway?","title":"Operation Choke Point 2.0: The Third Crypto War? | CoinMarketCap","detailedContent":"TL;DR: The crypto industry faces increased regulatory pressure. This is evidenced in lawsuits against firms like Coinbase and the case of Protego/ which was denied a national trust charter. Counter arguments presented by regulators emphasize the need for consumer protection and preventing illicit activities. The expanding role of larger banks/ such as JPMorgan Chase and Citi/ in servicing the crypto industry may change the situation for the better. There is growing discontent over regulatory processes and firms are fighting back with lawsuits of their own. Congressional hearings and legal challenges signal increased engagement from the legislative and judicial branches. The impact of regulatory decisions/ legal challenges and evolving banking relationships leaves the industry’s position in the United States in an uneven balance. The Second Crypto War is not even over yet/ but one cannot help but wonder whether the Third Crypto War has already begun. As the US seeks to balance innovation and consumer protection/ the regulatory landscape surrounding cryptocurrencies has become increasingly convoluted. Unfortunately/ it is also growing increasingly hostile towards the cryptocurrency industry. The regulatory crackdown/ dubbed Operation Choke Point 2.0/ poses new challenges for the industry’s survival in the US. Through a comprehensive analysis of the current state of crypto regulation and its implications on businesses operating in this sector/ this article will provide valuable insight into the future prospects and potential hurdles for the crypto industry in the United States. Subscribe Join us in showcasing the cryptocurrency revolution/ one newsletter at a time. Subscribe now to get daily news and market updates right to your inbox/ along with our millions of other subscribers (that’s right/ millions love us!) — what are you waiting for? Challenges and Accusations The crypto industry in the United States has faced a series of obstacles in recent times: Lawsuits on several fronts Denied applications General animosity towards the industry For instance/ Protego Trust/ a digital asset firm/ was denied a national trust charter by the OCC despite having met the necessary requirements and investing $80 million in regulatory capital. The company has been significantly impacted by this denial/ forcing it to lay off most of its staff and leaving its future uncertain. Unsurprisingly/ the company felt unfairly treated: View post on Twitter Operation Choke Point 2.0 The crypto industry has accused federal bank regulators of purposefully restricting access to the banking system for digital asset firms. Nic Carter dubbed this treatment \"Operation Choke Point 2.0\" — a reference to a past problematic initiative that targeted certain industries like firearms dealers and payday lenders/ believed to be of high risk for fraud and money laundering. Carter alleged in a blog post that regulators are considering using choke points to control the cryptocurrency industry and prevent collapses like the recent FTX debacle. By limiting access to fiat currency/ regulators want to marginalize the industry and avoid direct regulation. This crackdown is happening publicly through rulemaking and written guidance/ instead of backdoor conversations like in the past. The current approach is being marketed as \"safety and soundness\" and the regulators are dissuading banks from doing business with crypto. SEC Crackdown on Crypto Companies The Securities and Exchange Commission (SEC) has ramped up its focus on the crypto industry since October 2020/ charging and warning digital asset companies almost weekly. This intense scrutiny has left the industry at a point of crisis/ as many companies find themselves struggling to meet heightened regulatory demands which have/ in some cases/ significantly hindered their operations. Even though SEC Chairman Gary Gensler claimed clear rules for the industry already exist/ companies like Coinbase beg to differ. Coinbase is fighting back against the SEC by filing a lawsuit of its own. Regulatory Counter Arguments The regulatory authorities in the United States have come forward to address the allegations put forth by the cryptocurrency industry/ emphasizing that their actions aim to balance risk management and consumer protection rather than deliberately targeting crypto businesses. Regulatory bodies such as the SEC/ OCC and CFTC have countered the accusations by the crypto industry/ maintaining that they are focused on managing risks related to cryptocurrencies rather than targeting the industry specifically. Adrienne Harris/ superintendent of the New York Department of Financial Services (NYDFS) called the allegations “ludicrous.” She refuted accusations that the department trying to eliminate crypto businesses in the United States/ offering alternative explanations for the closure of Signature Bank: “The idea that taking possession of Signature was about crypto/ or that this is Choke Point 2.0 is really ludicrous. I mean/ I just have no other way to say it – what we saw was a new-fashioned bank run. When you have a high percentage of uninsured deposits/ and you don’t have liquidity management protocols in place/ you end up in a place where you cannot open on Monday in a safe and sound manner.” According to the NYDFS/ the closure of Signature Bank was primarily due to poor management and a lack of understanding of the risks involved in serving crypto businesses/ rather than being part of a hidden agenda aimed at eradicating the industry. The Role of Larger Banks Despite the ongoing challenges and regulatory scrutiny faced by the cryptocurrency industry in the United States/ there are indications that larger banks are starting to reconsider their stance on digital assets. JPMorgan Chase/ one of the largest banking institutions in the United States/ has recently begun providing banking services to well-established cryptocurrency exchanges/ such as Coinbase and Gemini. Citi/ another major financial institution/ has also expressed interest in extending services to cryptocurrency businesses and has been actively researching the potential of digital assets within the traditional financial ecosystem. These decisions by top-tier banking institutions suggest a potential change in attitude and growing acceptance of cryptocurrencies in the banking sector. This could signal increased support for the crypto industry within the traditionally conservative banking sector and lead to further expansion and integration between the banking and cryptocurrency ecosystems. It may also lay the groundwork for improved dialog and cooperation with regulatory authorities to help shape more inclusive and supportive policies for crypto businesses in the United States. The Effects on Crypto Companies The uncertain regulatory landscape in the United States has had a significant impact on cryptocurrency companies operating within its borders. Coinbase has reportedly been exploring an international move to mitigate regulatory concerns and hindrances in the United States. This relocation highlights the increasing pressure on US-based crypto firms grappling with the evolving and complex regulatory environment. Other cryptocurrency companies in the US continue to face various challenges as they navigate the ever-changing regulatory landscape. The federal bank regulators' crackdown on crypto firms may drive more exchanges and their customers to offshore banks in Puerto Rico/ Bermuda/ and the Bahamas/ aggravating risks and harm to the financial system. On the other hand/ the companies that choose to remain in the United States may have to endure significant hurdles in their operations/ including limitations on their access to crucial banking services or being forced to comply with a constantly shifting regime of rules and guidelines. Oliver von Landsberg-Sadie/ founder and CEO of crypto banking firm BCB Group/ called the situation “the SEC's chemotherapy for a giant gap/ for a $14 billion Ponzi cancer.” This shifting landscape suggests that the future of the US cryptocurrency industry remains uncertain. Congressional Hearings and Legal Actions The US Congress and judiciary are becoming increasingly involved in the discussion surrounding cryptocurrency regulations. A recent Congressional hearing featured testimony from SEC Chairman Gary Gensler and made crypto proponents happy/ as Gensler struggled to clarify his position: View post on Twitter Other hearings have summoned numerous cryptocurrency executives/ who presented their perspectives on the challenges and opportunities associated with the industry. On the legal side of things/ Protego/ a cryptocurrency firm/ has filed a lawsuit against the Federal Reserve alleging irregularities and unequal treatment in the bank charter application process. This legal action/ as well as the lawsuit Coinbase filed against the SEC/ signals broader discontent among crypto firms/ as well as the will and means to fight back. The legislative and judicial branches in the United States are increasingly paying attention to regulatory issues surrounding the cryptocurrency industry/ which could lead to changes in the regulatory landscape in the form of new laws. The Future of Crypto in the US — a Third Crypto War? Would it be justified to call this a “Third Crypto War?” That depends on who you ask. For instance/ Rob Leshner/ founder of Compound Labs/ recognized the concerted effort and bemoaned the lack of mainstream legal infrastructure for the industry to interact with the banking system. He said: “The map was wiped clean in an incredibly short amount of time due to government action in an unanticipated way…There’s an effort to de-bank crypto and it’s been – unfortunately – incredibly effective.” Mike Novogratz struck a similar tone. The CEO of Galaxy Digital sees a “widespread crackdown” against the industry. At the same time/ he remains hopeful the “system of checks and balances” in the form of the judiciary will reign in potential overreach by the regulatory authorities. But not everyone is bearish on crypto in the United States. Lou Kerner of the Crypto Oracle Collective called the regulatory crackdown “blatantly illegal” but also “irrelevant in the long run.” While that may drive crypto overseas in the short run/ he remains hopeful “the U.S. will get its crypto act together.” He called on the industry to #BUIDL/ a rallying cry for focusing on new products and services instead of becoming bogged down by political fights. Ultimately/ it may depend on the industry itself whether it can strike a compromise with politicians. There is certainly something to be said for a crackdown on crypto companies — and even more so on those that have been following the alleged rules like Coinbase. On the other hand/ even crypto advocates cannot deny that the fallout from the collapse of FTX and several big funds in 2022 did not spread to other industries. That indicates the existing ties between crypto and the traditional financial system were already weak/ and authorities are trying to isolate crypto altogether. While that may not be to the liking of crypto companies/ one can see the logic behind it/ especially considering the ongoing banking crisis. While this may not be a full-blown “Third Crypto War” yet/ it increasingly looks like a “Cold War” between US regulators and the industry. Check out the first crypto war/ which occurred in the early days of the internet where privacy advocates battled against government agencies. This article contains links to third-party websites or other content for information purposes only (“Third-Party Sites”). The Third-Party Sites are not under the control of CoinMarketCap/ and CoinMarketCap is not responsible for the content of any Third-Party Site/ including without limitation any link contained in a Third-Party Site/ or any changes or updates to a Third-Party Site. CoinMarketCap is providing these links to you only as a convenience/ and the inclusion of any link does not imply endorsement/ approval or recommendation by CoinMarketCap of the site or any association with its operators. This article is intended to be used and must be used for informational purposes only. It is important to do your own research and analysis before making any material decisions related to any of the products or services described. This article is not intended as/ and shall not be construed as/ financial advice. The views and opinions expressed in this article are the author’s [company’s] own and do not necessarily reflect those of CoinMarketCap.","date":"2023-05-22T09:30:23.175Z","tags":"","author":"Ivan Cryptoslav","category":"Crypto Basics","id":2000001}
,{"link":"https://coinmarketcap.com/academy/article/last-week-on-crypto-twitter-is-crypto-for-losers","websiteSource":"CoinMarketCap","type":"article","summary":"Our weekly recap of what Crypto Twitter had to say — from Andrew Tate to hardware wallets — read on to find out!","title":"Last Week on Crypto Twitter: Is Crypto for Losers? | CoinMarketCap","detailedContent":"Gm/ There’s contrarians and then there’s Andrew Tate. Tate went after Crypto Twitter this week/ but you better check for yourself what he had to say… View post on Twitter Needless to say this generated a ton of attention (just as planned). We’ll get to the reactions later/ but first some more educational stuff… Whose Threads Are a Must-Read? Threads are like good [redacted]: one week you don’t have enough of them and the next you cannot keep up physically because it’s so much. The latter was the case this week/ but one of the threads that really stood out was Loround’s list of smaller accounts that share alpha: View post on Twitter Smaller accounts don’t get enough credit on Twitter/ and the list has an account for every niche. Thread king Adam Cochran graced us with a new thread (only 25!) this week about the future of ETH staking: View post on Twitter His takeaway? ETH is a great investment because it’s a productive asset (yield incoming from ponzis)/ so it has plenty of upside. The thread is quite technical/ but the short version is “ape ETH responsibly.” If you don’t have capital to ape ETH/ that is probably because you haven’t made it in the bull and have to survive the bear now. Duh. But fear not/ Zero Ika has you covered: View post on Twitter Here are a couple of his best tips: Improve technical analysis skills. Develop a skill to build income streams. Keep an eye on new narratives. Bet on builders who are still active and delivering during the bear market. Check the thread for the rest and get prepared for a wild bull market in the not-too-distant future. Zak posted another great thread about ERC-6551. You don’t know what ERC-6551 does? NFT wallets/ baby! Check it out: View post on Twitter And if you’re really clueless/ there is a complete explainer article about ERC-6551 on Academy. Last but not least/ since Bitcoin is now actually being used/ the Bitcoin FOMO is moving ahead with no breaks on the train. According to this thread/ every Ethereum opportunity is coming to Bitcoin/ too: View post on Twitter Whether that will actually happen… remains to be seen. But it’s worth keeping an eye on the opportunities popping up on Bitcoin. Wisdom of the Week The thread section was strong last week/ and so was the wisdom section. Sometimes it is easy to get carried away by chasing numbers and forget how risky your investments are. A good reminders from Route2Fi on that: View post on Twitter So how can you make it without taking too much risk? Stay intellectually curious: View post on Twitter Ok/ enough with the high-IQ stuff. Here comes the drama (and a lot of it). Elon Building Twitter Elon had his hands full last week with fighting on all fronts. After he announced Linda Yaccarino as the new CEO the week before/ he went straight back to sparring with some of the biggest names on the platform. The offending object was the election in Turkey. Twitter got accused of throttling some accounts at the behest of the Turkish government and put out the following statement: View post on Twitter But Elon Musk was not impressed by how political commentator Matt Iglesias implied Twitter is engaging in censorship: View post on Twitter According to Elon/ Twitter pushes harder for free speech than “Wokipedia.” But it got even spicier when Elon picked a fight with billionaire George Soros: View post on Twitter This did not sit well with certain governments or factions of the establishment. Several media outlets questioned whether Musk’s statements were antisemitic/ and the Israeli government was not exactly amused either: View post on Twitter Now imagine how much fun Twitter will be in 12 months from now with the US election coming up. Buckle up… Talk of the Town The two main topics last week were hardware wallets and memecoins. Nothing unusual/ in other words. Ledger start a huge discussion by announcing its “Ledger Recover” social recovery feature/ which was interpreted as “Ledger can access your seed phrase.” View post on Twitter The culprit was the following deleted tweet from a Ledger rep. Can’t really say the reaction is surprising when you tweet out something like this: So obviously/ most of Crypto Twitter departed the sinking Ledger hardware wallet ship: View post on Twitter The company later tried to set the record straight in a tweet thread by its CTO/ which assured users it’s all fine: View post on Twitter Whether that will really calm the masses…well. You know how it goes in crypto. You either die a hero or live long enough to become the villain. Ledger has the hardware “main character” role now/ so let’s see when it can pass it on. And then there was Tate. Although he isn’t exactly universally well-liked around crypto circles/ reactions were mostly positive: And you can’t exactly disagree with almost all of what Tate says. Yes/ most community building is a psyop. Yes/ many tokens have 0 utility or added value. Yes/ crypto attracts gambling addicts that look for easy money. And you don’t have to look hard for proof-of-Tate when looking for crypto scams: View post on Twitter Or what about this beauty. The future of finance/ everybody: View post on Twitter Draw your own conclusions about how ready crypto and its “community” are for mainstream adoption in between shitcoins on Bitcoin and this. The chokehold on crypto is getting stronger. After the First Crypto War and the Second Crypto War/ there may be a third crypto war on the horizon… Our Favorite Coinfession Respawning the coinfessions in light of all the memecoin madness. Something like this happened probably way too often: View post on Twitter Always remember: for every buyer/ there is a seller… Memes This round-up has been quite hard on crypto/ so time to finish on a positive note. It could always be worse: View post on Twitter Stay safe and stay away from memecoins. Till next week! This article contains links to third-party websites or other content for information purposes only (“Third-Party Sites”). The Third-Party Sites are not under the control of CoinMarketCap/ and CoinMarketCap is not responsible for the content of any Third-Party Site/ including without limitation any link contained in a Third-Party Site/ or any changes or updates to a Third-Party Site. CoinMarketCap is providing these links to you only as a convenience/ and the inclusion of any link does not imply endorsement/ approval or recommendation by CoinMarketCap of the site or any association with its operators. This article is intended to be used and must be used for informational purposes only. It is important to do your own research and analysis before making any material decisions related to any of the products or services described. This article is not intended as/ and shall not be construed as/ financial advice. The views and opinions expressed in this article are the author’s [company’s] own and do not necessarily reflect those of CoinMarketCap.","date":"2023-05-22T09:05:25.346Z","tags":"","author":"Ivan Cryptoslav","category":"Crypto News","id":2000002}
,{"link":"https://coinmarketcap.com/academy/article/what-is-tenet-the-first-diversified-proof-of-stake-blockchain","websiteSource":"CoinMarketCap","type":"article","summary":"CoinMarketCap Academy dives into Tenet, a diversified proof-of-stake (DPOS) blockchain building using Cosmos SDK.","title":"What Is Tenet? The First Diversified Proof of Stake Blockchain | CoinMarketCap","detailedContent":"The blockchain industry is constantly evolving/ with new projects and protocols emerging at a breakneck pace to help tease out the full capabilities of the technology and deliver increasingly powerful use cases. Now/ a new/ user-centric blockchain/ known simply as Tenet/ is built using the Cosmos SDK and promises to provide a modular and flexible framework for developing powerful decentralized applications (DApps). This platform introduces a new consensus mechanism called Diversified Proof of Stake (DPOS) to power potentially the most secure and accessible DeFi ecosystem yet while dismantling typical barriers to entry through a novel stablecoin solution. Subscribe Join us in showcasing the cryptocurrency revolution/ one newsletter at a time. Subscribe now to get daily news and market updates right to your inbox/ along with our millions of other subscribers (that’s right/ millions love us!) — what are you waiting for? What Is Tenet? Tenet is bringing the most battle-tested decentralized virtual machine implementation to the Cosmos ecosystem — the Ethereum Virtual Machine (EVM). This will allow developers who are familiar with Ethereum’s tooling and SDKs to create and deploy applications on TENET Chain easily. This will provide current Ethereum and EVM-chain developers with a high-speed blockchain suitable for high-throughput and mainstream applications — including finance (DeFi)/ social apps/ data storage services and decentralized autonomous organizations (DAOs). Since TENET Chain is built on the Cosmos SDK/ applications built on the platform immediately benefit from interoperability with the broader Cosmos ecosystem/ thanks to the InterBlockchain Communication Protocol (IBC) — this includes popular chains like Cronos/ Kava/ Osmosis/ Canto and Thorchain. Tenet introduces the concept of \"diversified PoS\"/ which sees it rely on the shared market strength of a variety of other Proof-of-Stake blockchains/ to help massively reduce its vulnerability to attacks. Learn more about the different consensus mechanisms/ here. The team behind Tenet believes that using LSDs as a native staking instrument permits a more diverse and secure system/ allowing the network to achieve extreme economic stability. The following equation demonstrates how DPOS can be used to stack the security of multiple POS chains together to exceed the security of any one component chain. StakedA is the security afforded by staked $TENET tokens/ and LSDB/ LSDC/ etc./ is the security contributed by staked LSD assets. For this reason/ Tenet allows users to stake their cross-chain LSDs to the protocol and help to secure the blockchain. These users can operate their own validator or delegate their stake to a third-party validator to share in the transaction fees accrued on the network. Users that stake their LSDs to help bolster TENET Chain’s security will receive a yield on their assets. The platform will use a vote-escrow system in combination with native gauges to ensure all stakeholders in the Tenet ecosystem are fairly rewarded or incentivized. Two of the first applications built on TENET Chain include an in-house DEX used to provide liquidity for staked LSDs as well as an open lending market where users can lend/borrow LSDs and LSDC peer-to-peer. Who Are the Founders of Tenet? The platform is being built by an established team comprised of CEO Greg Gopman — the co-founder of Akash Network and previously CMO of Ankr; COO Dan Peterson/ previously Revenue Operations Specialist at $3B staking firm Blockdaemon; and Alex Cheng/ formerly a senior product manager at Tendermint-Cosmos. Advisors include OpenAI fellow Andrew Carr and Camyar Matini/ Blockdaemon's Director of Growth Strategy. What Is the Liquid Staking Dollar (LSDC)? Tenet introduces a robust decentralized stablecoin known as the Liquid Staking Dollar/ or LSDC. The token is backed by a distributed basket of liquid staking derivatives (LSDs). These will include ETH/ BNB/ ATOM and ADA derivatives/ with the potential to support additional assets in the future. The LSDC token can be minted with overcollateralized LSD positions across several popular protocols/ platforms and asset types. This allows it to maintain its peg with zero reliance on centralized infrastructure like banks. The stablecoin is overcollateralized and is backed by an on-chain proof-of-reserve that proves its solvency and resistance to black swan events — like collapsed TerraUSD (UST). It also helps LSD users easily maximize their capital efficiency/ by unlocking an additional source of yield on their deposits and easily leveraging up using interest-free loans available via the stablecoin protocol. View post on Twitter Current State of Development Tenet is currently operating a testnet with which users can now interact by adding the Tenet network and RPC details to their Web3 wallet — there are no plans for a community airdrop. Instead/ the platform will be conducting its public sale in Q2 2023 before listing on centralized and decentralized exchanges. DAO Maker was recently revealed as Tenet’s IDO partner. The platform is currently one of the best-performing IDO launchpads by all-time high ROI and will incubate the project over its development cycle. View post on Twitter Tenet's tokenomics model was inspired by the recently elaborated veToken system and is designed to maximize participation in the network. The parameters of Tenet's vote-locking system are shown below: According to the full tokenomics/ $TENET will launch with an initial market capitalization of $625/000 (excluding liquidity) with all investors subject to a 3-month cliff before seeing their tokens unlocked linearly over 20 months. Per the official roadmap/ Tenet is slated to launch its mainnet in Q3 2023/ a suite of applications will follow shortly thereafter/ including the decentralized exchange (DEX)/ lending market (alpha product) and LSD hub. The native gauge system will go live in Q4 2023. How Does Tenet Work? The operating parameters of Tenet's Diversified Proof of Stake module will be determined by decentralized governance/ where participants can propose and vote on details like the reward weight to determine how staking rewards are split between $TENET stakers and LSD stakers. Users can also vote on which LSDs are supported by the module. According to the official documentation/ the security of TENET chain is equal to the sum total security of its own native staking asset ($TENET) and the security of any LSDs staked on the network. In time/ it could eventually become more secure than any single POS chain (depending on the total value staked). Tenet aims to make the staking process as seamless as possible/ ensuring users get the same experience whether staking TENET tokens or LSDs derived from other native gas tokens. Only $TENET stakers can participate in the governance of the network/ LSD stakers are excluded from this process. Native $TENET tokens always have a reward weight of 1/ but this number is flexible for other stakeable assets. Such that with a reward weight of 1 for $TENET and 0.5 for LSDB/ $TENET stakers will share 66.6% of staking rewards/ with the remaining 33.3% going to LSDB stakers. These rewards are derived from inflation and transaction fees/ similar to Ethereum. Rewards are paid in the form of the TENET native asset. TENET Chain also supports an optional third reward type known as the take rate/ which is an annualized tax applied to LSDs staked on the platform. This take rate is shared among stakers on the TENET blockchain/ helping to diversify yields. Much like other Proof of Stake blockchains/ users will be free to delegate their stakeable assets to a validator of their choice/ based on properties like commission fee/ uptime and more. By using LSDs to secure its blockchain/ Tenet can effectively piggyback on the security of multiple sovereign chains. Because of this/ an attacker would need to take down multiple POS chains to successfully attack Tenet. The platform is built for a non-technical user base and aims to provide a human-friendly interface to the rapidly growing world of Web3 — allowing users to access the Cosmos ecosystem without the usual hurdles. Additional Features Tenet is a multi-faceted platform designed to address the shortcomings of existing layer-1s/ dismantle typical barriers to entry/ and unlock new opportunities for participants in the Web3 landscape. Besides the primary features outlined prior/ TENET Chain and the surrounding Tenet ecosystem also benefit from the following features: Stablecoin Gas: To help make transacting on TENET Chain less complicated/ gas can be paid in either $TENET tokens or $LSDC tokens — allowing users to pay the gas cost they see in exact LSDC amounts. 0% Interest Loans: LSD holders are able to take out a 0% interest loan in the form of $LSDC from the TENET protocol smart contract/ which can be used to leverage up or trade. Feeless DeFi Primitives: TENET’s feeless DeFi primitives further contribute to a user-friendly experience/ helping to minimize the interaction with complex transaction fees for some DeFi use cases — benefiting both users and developers alike. Cross-Chain Interoperability: Users can easily transact across different chains in the Cosmos ecosystem thanks to IBC/ and move their assets between independent L1s/L2s via the TENET Bridge. This provides opportunities for powerful cross-chain applications and experiences. High Scalability: Thanks to the highly efficient and secure Byzantine fault-tolerant (BFT) consensus algorithm/ TENET chain features high scalability on par with some of the fastest L1 chains — without sacrificing security. Community DAO: $TENET token holders can participate in the Tenet DAO to help govern the platform and related protocols. Unlike most other L1s/ Tenet has no VC funding/ ensuring the DAO remains controlled by the community rather than early investors. Native gauges: veTENET holders will be able to vote on how newly emitted TENET tokens are distributed within the Tenet ecosystem. It also includes provisions for third-party bribes/ helping to maximize rewards for veTENET holders and drive up demand for the $TENET token. What Is the $TENET Token? At the heart of Tenet is the $TENET token. This is used for a wide variety of purposes in the Tenet product ecosystem/ with its most prominent utility being its use as the platform’s native gas token. Users can spend $TENET tokens to pay for transactions and smart contract operations on TENET chain. It will also be woven into the apps built on the platform/ including Eva/ where users will need to pay a small fee in $TENET to perform financial operations. Some of its additional utilities will include: Access to discounted transactions in the Eva AI wallet Access to LSDC stability pool staking opportunities Participation in network validation Participation in the Tenet DAO for community governance $TENET token holders will need to participate in a vote-locking system to participate in network governance. This sees them lock their TENET tokens to receive veTENET (vote-escrowed $TENET). These users can then help decide where value accrues in the Tenet ecosystem — e.g. how block rewards and DeFi protocol incentives are distributed. What Is the Eva Wallet? Eva is one of the first applications built on Tenet. It's a Web3 wallet that leverages DeFiGPT to power a range of AI features/ such as an up-to-date crypto market chatbot. The wallet is designed to make interaction with the blockchain landscape as simple as possible/ making crypto payments and transactions as intuitive as regular banking. It enables the self-custody of assets and allows users to interact easily with DeFi applications without needing to understand the full details of how the underlying blockchain technology works. Eva is unusual among AI chatbots in that it will support voice commands/ allowing users to directly interface with the cryptocurrency market and explore current events intuitively. The wallet will use a combination of machine learning algorithms to accurately convert voice-to-text commands/ which it will then interpret and execute. View post on Twitter It will include a range of failsafe and security measures to ensure only authorized users can interact with the wallet and sign transactions before they are executed on the chain. By default/ Eva is a keyless wallet/ further reducing barriers for new users. View post on Twitter The team behind Tenet hopes that the intuitiveness of the Eva wallet will help more people reduce their reliance on centralized blockchain middleware/ like centralized exchanges/ custodians and lending platforms. The Eva wallet was recently released to the public allowing users to begin claiming $TENET and earn tickets — which can be used to unlock access to its upcoming limited public sale. This article contains links to third-party websites or other content for information purposes only (“Third-Party Sites”). The Third-Party Sites are not under the control of CoinMarketCap/ and CoinMarketCap is not responsible for the content of any Third-Party Site/ including without limitation any link contained in a Third-Party Site/ or any changes or updates to a Third-Party Site. CoinMarketCap is providing these links to you only as a convenience/ and the inclusion of any link does not imply endorsement/ approval or recommendation by CoinMarketCap of the site or any association with its operators. This article is intended to be used and must be used for informational purposes only. It is important to do your own research and analysis before making any material decisions related to any of the products or services described. This article is not intended as/ and shall not be construed as/ financial advice. The views and opinions expressed in this article are the author’s [company’s] own and do not necessarily reflect those of CoinMarketCap. CoinMarketCap is not responsible for the success or authenticity of any project/ we aim to act as a neutral informational resource for end-users.","date":"2023-05-19T14:01:59.762Z","tags":"","author":"Daniel Phillips","category":"Tech Deep Dives","id":2000003}
,{"link":"https://coinmarketcap.com/academy/article/are-these-the-next-blockchain-titans","websiteSource":"CoinMarketCap","type":"article","summary":"We peek into the crystal ball of blockchain innovation to look at some crypto projects that are gaining attention as the potential next big thing.","title":"Are These the Next Blockchain Titans? | CoinMarketCap","detailedContent":"The cryptocurrency and broader blockchain industry is in a constant state of flux. First movers often secure dominance in the market but can be displaced by ambitious startups with a better product/ stronger community and/or better leadership. There is also the potential for further growth/ expansion and improvement as pioneering developers invent new decentralized financial primitives and make them available to an increasingly diverse range of users — which now includes individuals/ organizations/ institutions/ governments and artificial entities. Given that some of the best-performing projects in 2021 (Avalanche/ BNB/ Dogecoin and Solana) yielded upwards of 1/000-10/000% returns in a year/ there is a good reason why savvy investors are looking for the next big thing now. Here/ we will take a look at seven crypto projects that are gaining traction among crypto users that may have the makings of something special in the next bull market. Subscribe Join us in showcasing the cryptocurrency revolution/ one newsletter at a time. Subscribe now to get daily news and market updates right to your inbox/ along with our millions of other subscribers (that’s right/ millions love us!) — what are you waiting for? Open Campus Open Campus is a blockchain-powered educational initiative designed to help users drive real change in the world and empower individuals with knowledge. The platform provides simple no-code tools that can be used to create gamified lessons/ courses and more. It hopes to provide a user and creator-centric education ecosystem that helps teachers monetize their educational resources and learners access high-quality educational materials on any topic of interest. At the heart of this new education ecosystem is the $EDU token/ which is used to govern the Open Campus Protocol/ as payment for creators and publishers/ and for minting educational content as NFTs. In essence/ it uses blockchain technology to democratize access to educational resources/ while providing a more equitable environment for educators and publishers. View post on Twitter Open Campus has already partnered with TinyTap/ Animoca Brands/ Highstreet/ The Sandbox/ and other prominent edutainment studios that will use the protocol to build their own content and curriculums. The project was the latest to launch on Binance Launchpad/ an IEO platform that has launched many successful projects. Historically/ several Binance Launchpad projects have gone on to achieve meteoric growth after launch/ including the likes of Axie Infinity/ The Sandbox/ Polygon and STEPN — each of which went on to define their respective niches. Learn more about Open Campus/ here. Sui One of the most anticipated layer-1s since the recent launch of Aptos/ Sui is an L1 that prioritizes true asset ownership/ performance and a simplified development and user experience. Sui is unusual among layer 1s in that it's object focused. Each programmable object on the blockchain is owned by a single address/ which can update and modify these objects by submitting transactions. It is unique in that consensus is only required when transactions involve shared objects. Transactions exclusively-owned objects can be processed without consensus using Byzantine Consistent Broadcast. The platform boasts \"infinity scalability\" using horizontal scaling/ allowing multiple bundles of transactions to be processed in parallel/ helping it achieve a throughput of ~300/000 transactions per second (TPS) with just 100 validators. Sui is designed to maximize security and protect asset ownership using an efficient delegated proof-of-stake model (DPoS). Users can lock their SUI tokens to help secure the network by delegating their tokens to their chosen validators. These users are rewarded in the form of a share of the network’s gas fee revenue. The platform is designed to cater to the next billion Web3 users by providing a fast and massively scalable base layer for decentralized applications. The platform conducted its token generation event on May 5/ 2023/ and was immediately listed on many of the most popular centralized exchanges — including Binance/ OKX/ KuCoin/ Bitfinex and Huobi. It’s backed by heavyweights including Binance Labs/ a16z/ Coinbase Ventures/ Jump Crypto and Circle/ and is now operating on its mainnet. According to the official Sui ecosystem directory/ there are now more than 200 projects building in the Sui ecosystem. This includes wallets/ synthetics/ games/ NFT marketplaces/ exchanges and more. XCAD Network XCAD Network was first launched in 2021 with the goal of enhancing creator-fan interactions through the use of Zilliqa-based blockchain technology. The platform was the first to introduce the concept of Watch2Earn/ allowing users to earn rewards in the form of creator tokens for watching and interacting with content from their favorite creators. The platform helps creators better monetize their content and form a more direct relationship with their audience using blockchain technology. Through XCAD Network/ creators can launch and distribute their own creator tokens and sell provably rare NFT moments. XCAD Network is currently used by dozens of popular creators/ many of which have tens of millions of subscribers — including the likes of Renato Garcia/ Niko Omilana/ Lance Stewart/ AM3NIC/ etc. In an attempt to simplify user acquisition/ XCAD Network provides a simple browser plugin that allows users to begin interacting with the network. This keeps blockchain elements behind the scenes/ helping to make participating in the network an intuitive and seamless process. With over 100/000 combined app and plugin users/ XCAD Network is currently one of the most popular Web3 applications and on-ramps. The XCAD exosystem also encompasses one of the most popular DEXs in the Zilliqa ecosystem/ providing key infrastructure for other DeFi builders. The platform recently expanded its feature set with a secondary token/ known as $PLAY. This helps to power the new Play section of the XCAD ecosystem/ allowing users to mint NFTs and earn additional rewards in the form of PLAY tokens when watching videos. View post on Twitter Sweat Economy In 2022/ move-to-earn (M2E) became one of the most popular use cases of blockchain technology/ with dozens of platforms emerging to help users earn token-based rewards for staying fit. By directly tying health milestones to token-based rewards/ the move-to-earn system helped to boost fitness motivation dramatically/ and it quickly became one of the most popular uses of blockchain technology. But Sweat Economy is currently by far the most popular move-to-earn application — with over 10 million users worldwide. The project distinguishes itself from other M2E apps by its user-friendly interface. By keeping most of the blockchain elements behind the scenes/ it is easier to get to grips with/ helping more people experience the capabilities of blockchain technology without the typical hurdles — like managing seed phrases or understanding gas fees. Sweat Economy initially launched as a Web2 platform known as Sweatcoin/ but integrated blockchain technology and tokenized rewards in 2022. This helped it become the most downloaded Health & Fitness app of 2022 — with over 65 million downloads worldwide. View post on Twitter The platform has partnered with multiple health organizations/ reward partners and charities/ and is constantly building new utility for the $SWEAT token. By driving adoption through utility/ Sweat Economy hopes to become a defining app for the Web3 space. Worldcoin Worldcoin is an ambitious upcoming project that aims to provide a worldwide financial and identity network/ helping to democratize access to crucial financial services. Long-term/ the platform wants to provide a truly government-free fiat alternative and use artificial intelligence to provide a universal basic income (UBI) to its users. Worldcoin has been in development since 2019 and was co-founded by tech industry heavyweights/ including OpenAI CEO Sam Altman. It has reportedly secured ~$100 million in funding. The platform consists of three primary components: The Worldcoin token: A digital asset used for payments/ governance and participation in the Worldcoin ecosystem. World ID: A privacy-preserving digital identity system. The platform uses iris-scanning technology known as the Orb to verify the identity of individuals. The World App: A mobile wallet application used for conducting transactions and identity proofs. The $WLD crypto is designed to be simple/ intuitive and immediately understandable to fiat users — keeping typical blockchain features hidden behind the scenes. Worldcoin recently released the World App/ allowing users to easily authenticate their identity and begin participating in the ecosystem. More than 1 million users worldwide have already signed up to begin using the platform. The wallet is gas free and can only be used by verified humans. The platform is being built on the Ethereum layer-2 scaling platform known as Optimism. View post on Twitter Fuel Network Billed as the \"world's fastest modular execution layer\"/ Fuel Network is designed to provide a powerful execution environment for modular blockchains — such as Celestia. The platform allows blockchains to benefit from massive transactional scalability/ thanks to its parallel execution capabilities. It provides a resource-efficient virtual machine implementation/ known as FuelVM. This is designed to be incredibly fast/ allowing smart contract operations and state changes to be performed quickly. It does this while keeping fees low/ helping to tackle the fee inflation currently seen by popular existing L1s — like Ethereum and BNB Chain. View post on Twitter Fuel applications can be built using the domain-specific programming language known as Sway. This is based on Rust and is highly simplified/ allowing developers to get to grips with the language with minimal barriers to entry. By providing a friendly developer experience and a generous grant program/ Fuel Network hopes to help bootstrap its DApp ecosystem — which already includes a variety of promising and useful projects. This includes the NFT marketplace ‘Thunder’ and DEX ‘SwaySwap’. Fuel Labs has been developing Fuel Network since 2018 and the platform is now in its testnet stage of development with its mainnet expected to launch later this year. Learn more about Fuel Network in our full deep dive. Celestia On the topic of modular blockchain infrastructure/ Celestia has been garnering a great deal of attention in recent months as a minimalist blockchain that separates data availability/ consensus and execution. The platform is designed to dramatically increase the scalability and flexibility of blockchains/ allowing anybody to deploy their own blockchain with minimal overhead. By providing on-demand consensus and security/ Celestia minimizes the costs associated with bootstrapping a blockchain and maintaining its security. Celestia is not involved in transaction validation and only ensures transaction data is made available through a novel process known as data available sampling (DAS). This innovation allows Celestia to avoid the throughput bottleneck faced by legacy blockchains while reducing the burden on nodes — helping with decentralization. The platform also leverages a technology known as Namespaced Merkle Trees (NMTs) which helps make data queries for specific applications far more simple and efficient. Celestia is widely considered to be a potentially foundational piece of blockchain infrastructure that could potentially boost the performance of dozens of layer 1s by acting as an efficient data availability layer. It currently has a growing ecosystem of applications and services/ many of which either leverage Celestia's modular architecture or act as accessory modules — such as execution environments or settlement layers. View post on Twitter This article contains links to third-party websites or other content for information purposes only (“Third-Party Sites”). The Third-Party Sites are not under the control of CoinMarketCap/ and CoinMarketCap is not responsible for the content of any Third-Party Site/ including without limitation any link contained in a Third-Party Site/ or any changes or updates to a Third-Party Site. CoinMarketCap is providing these links to you only as a convenience/ and the inclusion of any link does not imply endorsement/ approval or recommendation by CoinMarketCap of the site or any association with its operators. This article is intended to be used and must be used for informational purposes only. It is important to do your own research and analysis before making any material decisions related to any of the products or services described. This article is not intended as/ and shall not be construed as/ financial advice. The views and opinions expressed in this article are the author’s [company’s] own and do not necessarily reflect those of CoinMarketCap. CoinMarketCap is not responsible for the success or authenticity of any project/ we aim to act as a neutral informational resource for end-users.","date":"2023-05-19T03:09:48.990Z","tags":"","author":"Daniel Phillips","category":"Tech Deep Dives","id":2000004}
,{"link":"https://coinmarketcap.com/academy/article/what-is-worldcoin","websiteSource":"CoinMarketCap","type":"article","summary":"An ambitious project that aims to build the \"world’s largest identity and financial network\" as a public good and bring \"proof of personhood\" to users globally.","title":"What Is Worldcoin? Iris-Scanning Crypto Project Founded by OpenAI CEO Sam Altman | CoinMarketCap","detailedContent":"Introduction Despite the advancements in technology/ there is/ inevitably/ a subset of society that is still catching up. An estimated 1 billion individuals worldwide/ many in developing countries/ lack a legal identity or digitally verifiable one. Globally/ over 1.7 billion adults do not have access to a bank/ many in rural areas. Alongside the ever-looming presence of AI/ seen in the rise of AI technologies like ChatGPT by OpenAI/ and the proliferation of the internet/ this brings about the question: how can everyone have universal access to the global economy/ while distinguishing between bots and humans in the digital space? These two overarching themes come together to form the foundation of Worldcoin/ an open source system designed to provide proof of personhood and financial public goods simultaneously/ as AI technology becomes more prevalent. Subscribe Join us in showcasing the cryptocurrency revolution/ one newsletter at a time. Subscribe now to get daily news and market updates right to your inbox/ along with our millions of other subscribers (that’s right/ millions love us!) — what are you waiting for? What Is Worldcoin? Amidst the COVID-19 pandemic/ Worldcoin (WLD) was co-founded by none other than the CEO of OpenAI/ Sam Altman/ alongside Max Novendstern and Alex Blania. The founders believe that \"Worldcoin could drastically increase economic opportunity/ scale a reliable solution for distinguishing humans from AI online while preserving privacy/ enable global democratic processes/ and eventually show a potential path to AI-funded UBI.\" Worldcoin aims to be the “world’s largest identity and financial public utility”/ by leveraging blockchain technology to target the two above-mentioned issues to democratize access to the global economy/ especially for the less fortunate/ and as well as use it as a step towards universal basic income (UBI) to support the people whose jobs have been displaced by AI. Worldcoin is structured into three main segments/ namely: 1. World ID 2. World App 3. Worldcoin Token These three segments come together to form a comprehensive solution that is Worldcoin. What Is the World ID? World ID claims to be a decentralized/ privacy-protected identity solution/ intended to bring “global proof of personhood to the internet.” This essentially allows each user to prove that they are/ indeed/ a unique individual/ instead of bots that would misuse Worldcoin’s services and benefits granted to users. World ID is designed with the citizens of developing nations in mind/ many of whom do not have any properly verifiable forms of identification. Worldcoin stated that the World ID can be thought of as a “digital passport that lets you prove you are a unique and real person while remaining anonymous.” This data stored is protected by zero-knowledge technology/ which enables it to be used to verify a user’s personhood/ but without revealing their actual identity or their online habits to counterparties. The World ID is not tied to the actual biometric data/ but is simply a form of proof that the user is verified and can be trusted to be an actual human user. This is similar to most forms of identification that include certain watermarked/ embossed or holographic markings to certify the legitimacy of the document. The use cases of the World ID include allowing users to \"sign in with Worldcoin\" on a website/ mobile app or cryptocurrency DApp. What Is the World App? The first step to getting verified with World ID is getting Worldcoin’s mobile app/ known as World App/ with more options coming. World App functions very much like a stripped down crypto wallet/ plus a few additional features. It is tied to the user’s World ID and allows it to be used with Worldcoin’s related services/ such as Worldcoin grants. Worldcoin grants are payouts for users in eligible countries/ who are verified via World ID. They can be seen as a form of fair and equal distribution to all World ID verified users/ simply by nature of being able to prove that they are real humans. These grants are time-limited offers and are paid out in Worldcoin’s token/ WLD/ which is currently not trading yet. Additionally/ World App supports wallet features/ including sending and receiving tokens as well as the buying and selling of tokens. That said/ trading of tokens are currently limited to BTC (wrapped)/ ETH and DAI. Worldcoin explained that this allows users who are new to the crypto space to not be intimidated by the number of available tokens and can learn in a controlled environment. Users can also on-ramp and offramp funds easily via Moonpay and Ramp/ which have been integrated with the app. World App is currently in beta and runs on the Polygon blockchain. However/ Worldcoin recently announced that they are in the works to migrate World App to Optimism/ as part of Optimism’s Superchain. This is part of the collaboration between Optimism and Worldcoin and the migration is expected to come concurrently with the next Ethereum upgrade/ EIP-4844/ which will introduce a significant transaction fee reduction on Ethereum Layer-2s. Additionally/ the app integrates account abstraction via Safe’s tried and tested contracts/ allowing the user experience to be optimized for new crypto users. Beyond basic wallet functions/ World App also boasts Learn-to-Earn courses to provide new users with the materials to learn more about crypto and earn BTC/ ETH and DAI. While non-verified users can still access the materials/ the rewards for completion are only available to users who are World ID-verified. Other World ID benefits on the World App include gas-free transactions when using the wallet. Although the World App has only just been opened to the public/ more than 1.5 million users have already signed up/ of which 500K are active users. The app sees an average of 60K transactions daily and 25K World ID checks. With the app now open globally/ these numbers are only expected to rise. Source: Worldcoin (link) What Is the Worldcoin Token (WLD)? The Worldcoin token/ or simply Worldcoin (WLD)/ is the final piece of the puzzle. Within the World App/ Worldcoin is the currency in which grants are currently issued. View post on Twitter The Worldcoin token (WLD) went live on July 24/ 2023 and listed on exchanges like Binance/ Bybit/ Huobi/ Gate.io and more. The \"digital currency (WLD) received simply for being human\" allows users that have biometrically verified their identity at a worldcoin orb and download the World wallet app to receive WLD tokens. The WLD token has a maximum supply of 10 billion/ and the official ERC-20 contract address is 0x163f8c2467924be0ae7b5347228cabf260318753. Beyond grants/ Worldcoin will also be used for governance over the Worldcoin protocol to determine the direction and future of Worldcoin. Additionally/ the token can be expected to be integrated with the World App to be used as payments for specific services. Currently/ Worldcoin is not intended to be distributed to citizens in the United States or any of the other restricted regions. Users can learn more in the whitepaper. How To Get Verified on Worldcoin? While there are several layers to identity verification/ a user can get World ID verified only through Worldcoin Operators/ using a device known as the Orb. The Orb is a biometric imaging device/ which captures the user’s iris. Since an iris pattern is extremely hard to fake/ this is used as Worldcoin’s chosen method of identity verification to prove that a single person has not signed up for multiple World IDs. Since these verifications are done in-person with the World App/ this means that no other information such as their emails or names are required/ which makes World ID a pseudonymous form of identification. To get verified/ users can: 1. Download the World App on the App Store or the Google Play Store 2. After passing the initial setup/ users can find an Orb near them by following the instructions in the app. 3. Complete verification with a Worldcoin Operator at the chosen location. Once done/ the World ID will be available in the app/ enabling the user to access various services and benefits. Currently/ the Orbs are available for limited periods in the following cities from May to July 2023: Berlin Dubai London Mexico City Miami New York City San Francisco Seoul Tokyo Hong Kong Singapore Other locations and dates on their World Tour will be announced via their social media channels such as Discord and Twitter. Interested users can check out the Orb locations in their official website. Beyond Worldcoin’s use case of World ID for increasing accessibility to the global economy and financial services/ World ID can also be easily used in other applications/ such as social media sites looking to cut down on bot profiles. In fact/ World ID has been released with its SDK/ allowing builders to leverage their technology in their own applications. Concerns Over Worldcoin The Orb method of verification has riled up many privacy advocates/ with many criticizing the process as “dystopian-like.” In fact/ this stirred up a 2022 MIT Technology Review exposé which highlighted privacy concerns in Worldcoin’s practice and how the less fortunate were being exploited. Tools for Humanity/ one of the partners building Worldcoin/ had to step in to refute the allegations. Others/ like former Ethereum developer Hudson Jameson/ believes that Worldcoin shows a lack of transparency and regards its tokenomics as \"questionable.\" View post on Twitter Nevertheless/ Worldcoin is reportedly close to a $100 million raise/ a significant amount in the current market conditions. Worldcoin has already raised funds from prominent investors such as a16z/ Digital Currency Group and Coinbase Ventures in its Series A round. This article contains links to third-party websites or other content for information purposes only (“Third-Party Sites”). The Third-Party Sites are not under the control of CoinMarketCap/ and CoinMarketCap is not responsible for the content of any Third-Party Site/ including without limitation any link contained in a Third-Party Site/ or any changes or updates to a Third-Party Site. CoinMarketCap is providing these links to you only as a convenience/ and the inclusion of any link does not imply endorsement/ approval or recommendation by CoinMarketCap of the site or any association with its operators. This article is intended to be used and must be used for informational purposes only. It is important to do your own research and analysis before making any material decisions related to any of the products or services described. This article is not intended as/ and shall not be construed as/ financial advice. The views and opinions expressed in this article are the author’s [company’s] own and do not necessarily reflect those of CoinMarketCap.","date":"2023-05-17T10:32:20.954Z","tags":"","author":"0xKira","category":"Tech Deep Dives","id":2000005}
,{"link":"https://coinmarketcap.com/academy/article/hack-vs-scam-vs-attack-vs-exploit","websiteSource":"CoinMarketCap","type":"article","summary":"Explore the differences between crypto hacks, scams, attacks and exploits, and learn strategies to safeguard your digital assets. Enhance your crypto security knowledge.","title":"Hack vs Scam vs Attack vs Exploit: Understanding the Risks in Crypto and How To Stay Safe | CoinMarketCap","detailedContent":"TL;DR: Crypto hacking entails infiltrating a system or network. After gaining entry/ hackers can steal data or digital assets/ or inflict harm on the system. Crypto scams revolves around deceiving people into giving away sensitive data/ private keys to their wallets or their crypto assets directly. This could come from counterfeit or phishing emails to rug pulls. Attacks have a wider scope/ including any action targeting a digital system or network with the intent to cause disruption or damage. Crypto exploits refer specifically to exploiting vulnerabilities/ typically in crypto software to gain access and drain assets. As the use of cryptocurrencies gains widespread adoption/ so too does the prevalence of associated risks. Hacks/ scams/ attacks and exploits have all become common occurrences in the crypto ecosystem/ resulting in significant financial losses for both crypto users and even institutions. In this article/ we will delve into the distinctions between these four terms/ and explore strategies for safeguarding oneself against them. Whether you are an experienced crypto investor or a novice/ a comprehensive understanding of these risks and how to mitigate them is paramount. Let’s delve further into the realm of crypto hacks/ scams/ attacks and exploits. Subscribe Join us in showcasing the cryptocurrency revolution/ one newsletter at a time. Subscribe now to get daily news and market updates right to your inbox/ along with our millions of other subscribers (that’s right/ millions love us!) — what are you waiting for? Crypto Hacks Crypto hacks have become an unfortunate and frequent event — just take a look at the worst hacks last year. Hacks involve unauthorized access and theft of digital assets or information from cryptocurrency exchanges or wallets. These incidents can occur due to various reasons/ such as vulnerabilities in security systems/ social engineering techniques/ or even insider theft. The aftermath of such hacks can be disastrous for both the exchange or wallet and its users. Retrieving stolen digital assets can be challenging/ or even impossible/ while the reputation of the exchange or wallet can be irreparably damaged. A prime example is the infamous Mt. Gox hack in 2014/ where 850/000 bitcoins worth over $450 million were stolen/ resulting in Mt. Gox's bankruptcy and a diminished trust in cryptocurrency security. Digital currency exchanges and wallets must employ robust security protocols/ including two-factor authentication and cold storage/ to shield against hackers. Periodic security evaluations can further help in identifying vulnerabilities. It's also important to remember: “not your keys/ not your crypto.” Cryptocurrency users bear significant responsibility in averting hacks by securing their private keys/ utilizing distinct passwords/ and refrain from holding all of their digital assets on a single exchange or wallet. Regulatory bodies can also assume a pivotal role in preventing hacks in the crypto space. By establishing and enforcing security regulations and standards/ they can guarantee that exchanges and wallets adhere to a certain degree of accountability/ safeguarding users in the process. Recent Crypto Hacks Level Finance recently experienced a $1 million exploit due to a buggy smart contract. The decentralized finance (DeFi) platform's vulnerability was exploited by a hacker who took advantage of the faulty smart contract to drain funds from the platform. Level Finance confirmed the incident and assured users that it would investigate the issue further to identify the cause and ensure it does not happen again. In another case/ Hundred Finance lost $7 million in an Optimism hack. According to Certik/ the hacker “manipulated the exchange rate between ERC-20 tokens and hTOKENS/” allowing them to withdraw more tokens than deposited. Hundred Finance acknowledged the breach and assured users that it would work closely with the Optimism team to address the security flaws and recover the stolen funds. These two incidents emphasize the growing risks associated with the rapidly evolving DeFi ecosystem and the need for rigorous security measures to protect users and their digital assets. Crypto Scams In the world of digital currencies and anonymous personas/ scams are becoming a widespread problem — causing people to lose their crypto assets or personal information. These scams usually happen through phishing emails or websites/ schemes that promise big returns but don't deliver/ fake crypto projects or rug pulls/ and fake trading platforms. Also read: What Is a Rug Pull in Crypto? Phishing scams trick people into giving their login information or private keys to fake websites or emails that look real. Ponzi schemes are crypto projects that offer high returns/ but depend on new people joining to pay older members. Fake projects create a token and rug pull — dumping the token on people who bought and disappearing with the money. Finally/ fake trading platforms attract users with good deals but then take their crypto assets and disappear. To avoid being scammed/ it's important to be careful and watch out. Only use trusted trading places and digital wallets that have a good history of safety/ research before investing/ and be careful of any unexpected offers or messages asking for personal information or online money. Keep your private keys safe and don't share them with anyone. Recent Crypto Scam With the increasing excitement around memecoins like PEPE/ malicious individuals have begun to exploit the situation/ leading to an influx of scams in the crypto space. Blockchain security company PeckShield reported that in May/ there have been a minimum of 10 memecoin scams initiated. The firm identified and notified recent scam tokens that removed liquidity/ causing unsuspecting investors to fall prey to rug-pulling schemes. Crypto Attacks As the cryptocurrency landscape continues to expand/ the threat of cyberattacks like Denial-of-Service (DoS) attacks/ malware attacks and ransomware attacks is increasingly prevalent. A DoS attack overwhelms a network or system by flooding it with excessive traffic/ causing it to become inoperable. In the context of cryptocurrencies/ these attacks can target exchanges or platforms/ effectively denying users access to their digital assets or the ability to carry out transactions. Malware attacks/ on the other hand/ entail the installation of malicious software on a system or network/ granting an unauthorized party access to sensitive information or digital assets. Within crypto/ these attacks can result in private keys or login credentials being stolen/ providing an intruder with access to digital assets worth millions of dollars. Ransomware attacks involve the encryption of a system or network's files/ with the decryption key only being provided upon the payment of a ransom. These attacks can target exchanges or wallets/ effectively preventing users from accessing their digital assets until the ransom is satisfied. To protect against these attacks/ cryptocurrency exchanges and wallets must adopt strong security measures/ conduct routine security audits/ and utilize cold storage solutions to mitigate cyber threats. Recent Crypto Attacks A major cyberattack has struck one of the biggest cryptocurrency mining pools in the world/ which offers mining options for a range of digital assets/ including Bitcoin and Litecoin/ causing a significant loss of both company and customer funds. The incident took place on Dec. 3/ 2022/ with the attackers managing to steal roughly $700/000 in client assets and $2.3 million in assets belonging to the company. Crypto Exploits An exploit in the cryptocurrency world is a technique that takes advantage of a flaw or vulnerability within a system to gain unauthorized access/ execute malicious code/ or cause other undesirable effects. Such exploits often lead to the theft of coins or tokens/ resulting in financial losses for the victims. These exploits can occur in various ways/ including software bugs/ network attacks/ or even human errors/ and are becoming increasingly common in the crypto realm. Some common types of cryptocurrency exploits include flash loan attacks/ 51% attacks/ and wash trading. Flash loan attacks involve malicious actors taking out cryptocurrency loans to manipulate the market/ while 51% attacks occur when a single entity or group gains control of over 50% of a Proof-of-Work network's mining power/ enabling them to double-spend coins and disrupt transaction confirmations. Wash trading/ on the other hand/ involves the artificial inflation of a token's price through rapid buying and selling by a trader/ with the aim of making a profit when the price is pumped up. The consequences of these exploits can range from minor losses to significant financial damage. In March of 2023/ the crypto industry saw a total of 23 major attacks/ marking the second-lowest number of attacks since February 2022/ which had 21. The average loss per attack in March was $10/149/676/ a substantial increase from February's average of $1/742/748 per attack. Recent Crypto Exploits The most significant exploit in March was the Euler Finance incident/ resulting in a loss of around $200 million. Occurring on March 13/ 2023/ it has been the largest attack this year. The attacker/ known as Jacob/ leveraged assets borrowed from a flash loan and exploited vulnerabilities within Euler's pool contracts to drain five Euler Finance Pools. Since then/ Jacob has gradually returned $177 million of the stolen funds. The second-largest exploit happened on Feb 3/ when Polygon-based lending and stablecoin protocol/ BonqDAO and AllianceBlock/ was hit by a two-stage attack on Wednesday in a price oracle manipulation. The exploit was reported to be $120 million/ although the exploiter only managed to siphon off $1.3 million worth due to low liquidity. Differences Between Hack/ Scam/ Attack and Exploit Understanding the nuances between hacking/ scamming/ attacking and exploiting is essential. These terms refer to distinct types of threats that can compromise one’s digital assets. Hacking involves breaking into a system or network/ often through exploiting vulnerabilities in software or hardware. This may involve techniques like brute force attacks or phishing scams. Once access is gained/ hackers can steal data or digital assets/ or cause damage to the system. Scamming/ on the other hand/ is focused on tricking individuals into giving away sensitive information or crypto. This can take many forms/ from fake emails posing as legitimate crypto platforms to fraudulent investment schemes. Attacks are broader in scope/ encompassing any action that aims to disrupt/ damage/ or destroy a digital system or network. Exploits/ meanwhile/ refer specifically to taking advantage of vulnerabilities in software or hardware to gain unauthorized access or control over a system or network. It's important to note that while hacking and exploiting are similar and often require technical skills and knowledge/ scamming and attacking can be carried out through social engineering tactics like phishing. This article contains links to third-party websites or other content for information purposes only (“Third-Party Sites”). The Third-Party Sites are not under the control of CoinMarketCap/ and CoinMarketCap is not responsible for the content of any Third-Party Site/ including without limitation any link contained in a Third-Party Site/ or any changes or updates to a Third-Party Site. CoinMarketCap is providing these links to you only as a convenience/ and the inclusion of any link does not imply endorsement/ approval or recommendation by CoinMarketCap of the site or any association with its operators. This article is intended to be used and must be used for informational purposes only. It is important to do your own research and analysis before making any material decisions related to any of the products or services described. This article is not intended as/ and shall not be construed as/ financial advice. The views and opinions expressed in this article are the author’s [company’s] own and do not necessarily reflect those of CoinMarketCap.","date":"2023-05-16T08:26:55.470Z","tags":"","author":"Andrey Sergeenkov","category":"Crypto Basics","id":2000006}
,{"link":"https://coinmarketcap.com/academy/article/centralization-risk-in-crypto","websiteSource":"CoinMarketCap","type":"article","summary":"Explore the complexities of centralization in the crypto industry and its risks in assets like Ethereum, Bitcoin, popular layer-ones and DeFi.","title":"Centralization Risk in Crypto: How Decentralized Is Crypto? | CoinMarketCap","detailedContent":"TL;DR: Centralization in crypto occurs when there are choke points within the technology stack/ leading to potential censorship and risks. Examples include a limited number of internet service providers/ concentrated mining operations/ and centralized node hosting. Censorship can be strong/ where transactions are excluded from a block/ or weak/ occurring on the infrastructure level. Centralization risks come in various forms/ such as governance/ consensus/ motivational/ topological/ and network/ all of which can have a ripple effect across the industry. The crypto industry has a love-hate relationship with centralization. We need centralization/ but we don't like it. Everything should be as decentralized as possible/ but we also love fast transactions and low fees. Centralization risk is real. 2022 highlighted the risk of centralization of capital with the collapse of 3AC and FTX. But there are other centralization risks out there/ and you don't have to dig deep to find them even in the most popular cryptocurrencies. Subscribe Join us in showcasing the cryptocurrency revolution/ one newsletter at a time. Subscribe now to get daily news and market updates right to your inbox/ along with our millions of other subscribers (that’s right/ millions love us!) — what are you waiting for? What Is Centralization In Crypto? Centralization in crypto comes from centralized points in the tech stack. Any time there is a choke point in the infrastructure/ centralization occurs. To name only a few examples: There are only a handful of internet service providers to use. Miners are concentrated due to economies of scale in hash power/ meaning it's easier for bigger mining farms to be profitable. Nodes can have centralized clients or rely on centralized node hosting. Centralization can also lead to censorship. Here/ censorship refers to the exclusion of transactions or addresses. We can distinguish between strong censorship and weak censorship. Strong censorship is the exclusion of transactions from a block. It happens on the protocol level when miners don't process a transaction from a certain address. One example would be the Tornado Cash sanctions. The Office of Foreign Assets Control (OFAC) sanctioned Tornado Cash and several associated Ethereum addresses in August 2022/ leading to relay operators to filter specific transactions. Weak censorship can happen at the protocol or the infrastructure level. An example is DeFi frontends or infrastructure providers like Infura restricting the flow of transactions through their nodes. Of course/ this happened with Infura a few months ago/ sparking a discussion about the decentralization of Ethereum. The conclusion is that more centralization opens the way to more potential censorship. But centralization can come in many shapes and sizes. Different Types Of Centralization Risks A study about blockchain decentralization by blockchain security company Trail of Bits points out different vectors of centralization risks. Governance: how many entities are needed to disrupt the system? Consensus: how many entities control the hashing or validation power? Motivational: how are participants incentivized to act correctly? Topological: can a few nodes be disrupted/ impacting the entire network? Network: are nodes dispersed geographically and across internet service providers (ISP)? Software: does the blockchain depend on any special software? Some of these have been well-known topics of discussion for Bitcoin/ Ethereum and other chains. For example/ while consensus and governance centralization are similar/ you can argue that Ethereum is exposed to an added risk vector through Vitalik. If someone \"disrupted\" Vitalik/ it would throw Ethereum into turmoil/ regardless of how many entities control validation power. In a way/ this happened to Solana when FTX/ one of its biggest backers/ went under. In similar fashion/ topological centralization can harm scaling solutions and alternative L1 chains. They depend on cross-chain bridges/ which can be exploited and proverbially sever the link to the more liquid ecosystems. Examples of this abound: The $190M hack of Nomad. The hack of Binance's bridge. The $625M hack of Ronin bridge. With that in mind/ what kind of centralization risks do the big ecosystems face? Centralization Risk In Ethereum Ethereum has a fair bit of centralization risk. Take consensus centrality. At the time of writing/ Lido and the top three CEXes Binance/ Coinbase and Kraken hold a majority of the staked ETH. Source: dune.com While Lido technically only \"aggregates\" the delegated staking power it is assigned/ the concentration of voting power in the hands of a few entities can lead to cartelization. MEV can even amplify this going forward. Speaking of MEV/ this has become another point of discussion for Ethereum. In simple terms/ MEV refers to the profit miners can make by prioritizing some transactions over others. This process of front-running has led to the rise of MEV boost relay companies. These are companies providing tools that help everyone to capture a slice of extra profit from MEV. The problem? Validators that use these tools outsource the decision over what transactions go into a block to the MEV boost relayers. And if these companies want to be compliant with/ say/ a sanctions regime that can exclude certain blocks/ that would be censorship. Censorship/ which comes from centralization. Below is the share of \"sanctions-compliant blocks\" in Ethereum: Source: mevwatch.info The share is currently declining/ but the centralization risk is there. Then there are centralized choke points: validator clients and node hosting diversity. Most of Ethereum's nodes depend on one execution client (Geth). AWS hosts the majority of nodes. Two companies provide a majority of nodes with consensus clients. Source: Messari While these are not imminent or even critical risk vectors/ they go to show that even a nominally decentralized chain like Ethereum is not that decentralized. You can have many nodes/ which are widely distributed geographically/ and still have centralization bottlenecks. And Gary Gensler doesn't even consider Ethereum validators to be that decentralized/ which is why the SEC argues that ETH is a security. Ethereum addressed this with an addition to its roadmap called “the Scourge.” So the community is aware of these potentially problematic issues and is looking to resolve them. Centralization Risk In Bitcoin Bitcoin's community prides itself on Bitcoin being the most decentralized blockchain. But there are also centralization risks in Bitcoin. The obvious one is the concentration of hash power in the proverbial hands of a few mining entities. AntPool (30.63%) and Foundry USA (19.77%) control a majority of the hash rate at the time of writing. Add a third pool in F2Pool (14.26%)/ and you have a comfortable majority. A fourth in Binance Pool (11.5%)/ and 75% of the hash rate is owned by four mining pools. Source: blockchain.com This is not necessarily bad or an immediate risk. Bitcoin's security model aligns miners' interests with that of the network as a whole. However/ not being a risk today does not mean it cannot become a risk ever. The Nakamoto Coefficient measures how many entities are necessary to disrupt a blockchain system. For Bitcoin/ it's currently only at two since only two mining pools would need to be disrupted. Moreover/ the Trail of Bits study found that 60% of Bitcoin traffic traverses only three ISPs. Bitcoin ASICs production is highly centralized/ with a few players like Bitmain and MicroBT dominating the market. Since Bitcoin’s value is a function of the kinetic energy it converts via ASICs/ centralization is naturally going to occur. The geographic distribution of BTC mining power follows a similar pattern: 58% of the mining power in January 2022 were located in the US (37%) or China (21%)/ according to the Cambridge Institute for Alternative Finance. For a currency whose community would like to see it become the next world reserve currency/ Bitcoin is not all that much more decentralized than fiat currencies. Centralization Risk in Other Layer-One Chains Other blockchains like BNB Chain and Solana have often faced the wrath of hardcore crypto supporters/ who accuse them of being too centralized. For instance/ some pointed out that BNB Chain only has 21 validators. However/ BNB Chain developers have also stressed that decentralization is a process and not an end state BNB Chain claims to already have reached: View post on Twitter Solana has had to battle with repeated outages over the last years due to its hardware-hungry blockchain. This has led to Crypto Twitter quipping that Solana has “opening hours” and a support desk that will address issues when needed. And while it is true that Solana is heavily influenced and controlled by the Solana foundation/ in other regards it is also more decentralized than chains like Ethereum or Bitcoin. For example/ Solana’s Nakamoto Coefficient of 27 is much higher than that of its bigger rivals. Solana also requires no minimum stake to be a validator. Though Ethereum works around this requirement with liquid staking derivatives/ it introduces the very centralization many fear. Node hosting providers are similarly (de)centralized as with Ethereum: Source: coinmonks.com On the other hand/ hardware requirement is famously expensive/ which has contributed to the very outages that keep plaguing the blockchain. Centralization Risk in DeFi This guide wouldn't be complete without a section on centralization risks in DeFi. They are a major concern and point of discussion for crypto natives. One of the primary risks associated with DeFi is the potential for a single entity to gain control over a large portion of the network. Be it through majority control of the governance power or being able to unilaterally change the smart contracts power a protocol. DeFi is far less equipped to deal with these risks than crypto folks like to admit. The Wormhole hack in February 2022 is a prime example of this. A hacker was able to steal 120/000 wrapped Ether (wETH) from Wormhole/ a cross-chain bridge. The hacker was able to do this because the project had a vulnerability that allowed them to gain control of the funds. But the story doesn't end there. The Wormhole hacker attempted to escape with the funds by moving them through various protocols. However/ in February this year/ Jump Crypto/ the fund that initially plugged the liquidity hole caused by the hack/ was able to recover the funds. But that required a bit of centralized help. Jump Crypto was able to obtain a court order from the High Court of England and Wales/ which directed Oasis Protocol to take all necessary steps to retrieve the assets. And by necessary steps/ we mean changing the multisig to retroactively strip the hacker of their funds. Was this an example of how centralization can be (ab)used in DeFi? Only through the intervention of a centralized entity was the hacker stopped. Not very decentralized/ is it? View post on Twitter Conclusion Centralization risks in blockchains are real. Hosting providers and internet service providers are common bottlenecks for almost all blockchains. The concentration of capital and/or hardware inevitably leads to centralization. But it’s also important to keep in mind that centralization in itself isn’t bad. As long as stakeholders in blockchain ecosystems work towards developing and improving the chain/ centralization can even lead to efficiency gains. Crypto supporters just need to be mindful of how to mitigate the side effects of centralization. This article contains links to third-party websites or other content for information purposes only (“Third-Party Sites”). The Third-Party Sites are not under the control of CoinMarketCap/ and CoinMarketCap is not responsible for the content of any Third-Party Site/ including without limitation any link contained in a Third-Party Site/ or any changes or updates to a Third-Party Site. CoinMarketCap is providing these links to you only as a convenience/ and the inclusion of any link does not imply endorsement/ approval or recommendation by CoinMarketCap of the site or any association with its operators. This article is intended to be used and must be used for informational purposes only. It is important to do your own research and analysis before making any material decisions related to any of the products or services described. This article is not intended as/ and shall not be construed as/ financial advice. The views and opinions expressed in this article are the author’s [company’s] own and do not necessarily reflect those of CoinMarketCap.","date":"2023-05-16T06:50:46.710Z","tags":"","author":"Ivan Cryptoslav","category":"Tech Deep Dives","id":2000007}
,{"link":"https://coinmarketcap.com/academy/article/what-are-vampire-attacks-in-crypto","websiteSource":"CoinMarketCap","type":"article","summary":"A vampire attack takes place when a new project or protocol, usually a fork from an established blockchain project, provides improved incentives or rewards for users compared to the original.","title":"What Are Vampire Attacks in Crypto? | CoinMarketCap","detailedContent":"Originally/ the term ‘vampire attack’ was limited to the wireless sensor networks/ where it described a very specific kind of attack where an attacker drains the energy of a network node/ rendering it useless or inefficient. The term has since been co-opted by the crypto community/ where it is now used to describe an attempt to drain a competitor’s critical resources or outcompete it by virtue of its advantages. Vampire attacks can simply be described as a type of aggressive marketing or growth strategy/ rather than outright theft or nefarious activities/ despite the negative connotations associated with the word “attack.” Also read: Hack vs Scam vs Attack vs Exploit Subscribe Join us in showcasing the cryptocurrency revolution/ one newsletter at a time. Subscribe now to get daily news and market updates right to your inbox/ along with our millions of other subscribers (that’s right/ millions love us!) — what are you waiting for? What Are Vampire Attacks? In the world of decentralized finance (DeFi) and non-fungible tokens (NFTs)/ a vampire attack occurs when a new project or protocol — typically a fork of an existing blockchain project — offers better incentives or rewards to users than the original project. Generally/ successful vampire attacks result in a significant loss of liquidity and network effects for affected projects. In some cases/ the new project may even completely \"suck the life\" out of the original project/ hence the term \"vampire attack”/ in these cases/ the project can be essentially completely abandoned in favor of the new one. Vampire attacks can be either very common or extremely rare/ depending on how strict your definition is. But today/ it is safe to say that most popular DeFi and NFT protocols have either experienced or initiated some form of a vampire attack. For instance/ the upstart NFT marketplace Blur against OpenSea: Comparison to Other Attack Types Vampire attacks differ greatly from the regular black or grey hat attack types common to the DeFi and broader crypto industries. While they are considered an ‘attack’/ they’re generally legal and are simply a form of competition. Besides the regular hacks/ brute forcing and phishing attacks/ there are a number of more nuanced attacks that currently affect the crypto space. Here are some of the most prominent: Sybil attacks: Sybil attacks involve creating multiple fake identities to manipulate a system. In DeFi/ this type of attack can take the form of a fake liquidity provider/ or be used to accumulate control over a decentralized autonomous organization (DAO). Front-running attacks: Front-running attacks involve exploiting the time delay between when a transaction is sent and when it is processed. In DeFi/ this type of attack can take the form of a miner extracting value (MEV) from a transaction before it is confirmed/ such as by sniping potentially profitable transactions or siphoning profit from traders using sandwich tactics. Learn more about front running and miner extractable value. Insider attacks: Insider attacks involve an individual within the system abusing their access privileges. In DeFi/ this type of attack can take the form of a developer adding a backdoor to a smart contract/ or an employee buying up/selling spot market tokens before an important announcement or product update. 51% attacks: This occurs when an attacker or group of attackers are able to temporarily gain a more than 51% share of a network’s hash rate or validator set and can double-spend funds. This most commonly occurs after a blockchain re-org or fork. The main difference between vampire and other attack types is that the former involves using whitehat strategies to drain liquidity/ users/ trading volume/ or some other key resource from competing platforms/ whereas most other attacks involve hacking/ manipulation/ and/or exploitation. Usual Targets of Vampire Attacks Vampire attacks are a relatively common affair in the DApps space/ but some projects are far more likely to fall victim to one if they are prime targets. Generally/ any project that relies heavily on user adoption and liquidity is vulnerable to vampire attacks. This includes decentralized exchanges (DEXs)/ NFT marketplaces/ yield farms and any other project that features liquidity pools. View post on Twitter Some of the features that make a project particularly susceptible to an attack include: High liquidity: Projects with high liquidity are attractive targets for vampire attacks/ as they offer a large pool of capital for the attacker to capture. Established user base: Projects with an established user base are also vulnerable/ as they have a community that the attacker can tap into. High fees: Projects that charge high fees to users are particularly vulnerable/ as the attacker can offer lower fees to attract users away from the original project. Lack of innovation: Projects that lack innovation and fail to offer new features or better incentives to users prime targets for vampire attacks/ as they are more likely to be eclipsed by a fast-moving competing project. Steps To Carry Out a Vampire Attack Now that we’ve understood what kind of projects are vulnerable/ let’s look at the usual methods and steps a project typically takes before carrying out a vampire attack. Identify the target platform. Offer higher incentives to attract users from the target platform/ such as airdrops. Employ several marketing methods to inform the target community about the new platform and its advantages. Introduce new liquidity pools on the new platform to gradually expand its offering. Use the new platform's tokens as rewards to incentivize users to move their liquidity. Increase liquidity and trading volume on the new platform. While this strategy can be effective in attracting users and increasing liquidity/ it's often viewed as unethical and could be detrimental to the overall health of the ecosystem. On the other hand/ increased competition could seed out legacy projects that do not innovate and ultimately reward the end users. Preventing Vampire Attacks Now that you know about how these attacks are typically carried out/ let’s dive into the methods and practices projects use to reduce their vulnerability to these attacks/ or recover after being attacked. Lock-in period Commitment to a lock-in period can be required for new liquidity providers. This prevents them from providing liquidity only to withdraw it immediately after receiving their rewards/ leaving the protocol with reduced liquidity. This is an example of mercenary behavior and is common to new DEXes. Token withdrawal restrictions Restricting the number of LP tokens that each user can withdraw over a period of time can prevent the mass migration of users and liquidity. This ensures that the protocol retains a sufficient amount of liquidity to function properly since illiquid DEXes typically suffer from high slippage. Voting mechanism A voting mechanism or full DAO structure can allow users to have a say in the direction of the protocol. This can help prevent vampire attacks by allowing users to choose protocols that are more aligned with their interests while maximizing the room for further growth. Dynamic rewards Dynamic rewards can help to maximize participant loyalty by providing an incentive to contribute liquidity or remain active for longer. By providing increased rewards for commitment and loyalty/ platforms can help to reduce user churn/ attract loyal users and retain existing users. Token vesting By vesting rewards to liquidity providers/ platforms can ensure they maintain their liquidity for longer. Some platforms also go one step further by forfeiting rewards if users withdraw their liquidity before a certain minimum commitment period. Security audits By maximizing security/ platforms can boost user confidence/ giving them an edge over competing platforms that aren’t necessarily battle-tested or proven robust. These solutions can mitigate most/ if not all/ of the risks associated with vampire attacks and promote healthy competition between protocols in the cryptocurrency ecosystem. Prominent Examples of Crypto Vampire Attacks The clearest examples of vampire attacks arise through forks/ whereby an existing blockchain or protocol is copied/ modified and launched as a direct competitor to the original. By offering better incentives for users/ nodes/ developers/ investors/ partners/ and more/ the fork aims to suck the life out of its predecessor/ and go on to become the default platform going forward. Some of the more prominent examples of vampire attacks/ albeit not all were successful/ include: 1. SushiSwap/UniSwap: At launch/ the decentralized exchange (DEX) SushiSwap used enhanced incentives to entice liquidity providers away from the leading AMM DEX/ Uniswap. It later differentiated its feature set and capabilities to grow its user base. However/ Uniswap currently retains its position as the market leader. 2. Blur/OpenSea: NFT marketplace Blur incentivized the migration of traders from competing platforms through the use of airdrop incentives. The platform temporarily overtook OpenSea by trading volume and other metrics/ such as royalty fees. 3. Dash/Masternode projects: Dash fell victim to wave after wave of vampire attacks after it popularized the masternode concept to unlock additional blockchain utility. Later masternode projects including PivX/ SmartCash/ ZCoin/ Dash Diamond/ and more either forked and modified Dash or replicated its functionality to directly compete with it. Overall/ vampire attacks could be seen as a positive for the web3 ecosystem since they give rise to stiffer competition among projects — regardless of how established they are — and force innovation and improvement. While many projects that employ vampire attack tactics offer nothing unique or distinguishing/ many have proven to be intrinsically superior to competitors/ and have gone on to prove their legitimacy and value. Those that are low effort cash-grabs tend to cannibalize one another/ before falling into obscurity. This article contains links to third-party websites or other content for information purposes only (“Third-Party Sites”). The Third-Party Sites are not under the control of CoinMarketCap/ and CoinMarketCap is not responsible for the content of any Third-Party Site/ including without limitation any link contained in a Third-Party Site/ or any changes or updates to a Third-Party Site. CoinMarketCap is providing these links to you only as a convenience/ and the inclusion of any link does not imply endorsement/ approval or recommendation by CoinMarketCap of the site or any association with its operators. This article is intended to be used and must be used for informational purposes only. It is important to do your own research and analysis before making any material decisions related to any of the products or services described. This article is not intended as/ and shall not be construed as/ financial advice. The views and opinions expressed in this article are the author’s [company’s] own and do not necessarily reflect those of CoinMarketCap.","date":"2023-05-15T13:54:52.577Z","tags":"","author":"Daniel Phillips","category":"Crypto Basics","id":2000008}
,{"link":"https://coinmarketcap.com/academy/article/last-week-on-crypto-twitter-crypto-bros-printing-trillions-out-of-thin-air","websiteSource":"CoinMarketCap","type":"article","summary":"Only one group is allowed to make money out of thin air — and that's not the crypto bros. Check out CT's reaction to Congressman Sherman and more in our crypto twitter roundup!","title":"Last Week on Crypto Twitter: Crypto Bros Printing Trillions Out of Thin Air | CoinMarketCap","detailedContent":"Gm/ You crypto bros really thought you’d get away with this/ didn’t you? Can’t just print money out of thin air/ bro. That is a moat only one player has: View post on Twitter And yes/ this video is real and not AI-enhanced (the author had to double-check/ too). Let’s see how crypto bros reacted to that and much more… Whose Threads Are a Must-Read? Thread section is coming up a bit shorter this week. However/ if you are looking for “muh macro outlook/” look no further than the LeBron James of macro investing: Stanley Druckenmiller. This is/ strictly speaking/ not a crypto thread but still highly relevant. Druckenmiller gave a presentation about whether US exceptionalism is at risk: View post on Twitter It’s a dense topic (especially for you crypto bros printing money out of thin air)/ so here’s the TLDR: The US fiscal position is on an unsustainable path/ with debt levels only comparable to those after WWII. The fiscal gap is equivalent to a 40% increase in all Federal taxes collected/ or a cut of 35% in federal spending. Druckenmiller is bullish on generative AI/ and is currently short USD/ long Gold/ Euro/ Oil and AUD. So if crypto can demonstrate a use case for the AI revolution or become a commodity/ could it moon as well? Who knows. Regardless/ this is well worth a read since Druckenmiller is one of the all-time great investors. Something crypto bros will definitely be able to relate to is a ‘why this token is gud’ thread. Coming to your rescue is Crypto McKenna with a thread about Arbitrum and its promising ecosystem: View post on Twitter And the obligatory TLDR: Arbitrum is actively capturing Ethereum protocols/ users and liquidity. The 7-day rolling transaction count on $ARB has increased from 222.7k to 1.45m since the start of 2023. EIP-4844 is a proposed improvement that could reduce gas fees on roll-ups by 10-30x. In other DeFi-related news/ here is a thread on good security principles for your DeFi wallet: View post on Twitter Speaking about clean wallets… Wisdom of the Week PEPE cleaned the wallets of late longs ever since being listed on centralized exchanges. The frog has been boiled quickly and is down over 60% from ATHs at the time of writing/ but you hopefully learned the most important lesson here: View post on Twitter Price determines price in crypto. But don’t worry if you are still broke. Many more memecoins will likely come (and go). Elon Building Twitter It’s been a while since the last Elon crypto pump and Elon Twitter drama. But we are. So. F***ing. Back. Elon delivered on both ends last week. First/ he shamelessly pumped the Milady NFT collection: View post on Twitter Why? Because he can. Because the most entertaining outcome is the most likely. And because Elon also deserves some time off in between picking new CEOs for Twitter: View post on Twitter Between those and Tucker Carlson announcing he will be using Twitter as his main platform/ we are guaranteed more entertaining outcomes in the near future. Talk of the Town Crypto bros were in shock and disbelief over the attitude displayed by Congressman Sherman: View post on Twitter Safe to say the fight between crypto bros and the US government is still in its early rounds. One of the judges/ namely the US Chamber of Commerce/ may have scored a round in favor of crypto bros last week in its statement: View post on Twitter That must have felt good for Coinbase/ which had a tough last week after a serious blunder when it labeled PEPE a “hate symbol” in a newsletter. You know what had to come next: View post on Twitter As it always goes/ the pitchforks came out and Coinbase backpedaled. But so far/ it hasn’t listed PEPE/ so maybe we’ll have to wait for round two of the memecoin madness for that to happen. But undoubtedly one of the biggest topics of the week was people using the Bitcoin blockchain for transactions. Yes/ you read that right. Not only that/ but BRC-20 tokens bricked the Bitcoin blockchain for normal users: View post on Twitter Some/ like Michael Saylor/ are actually bullish on this sudden surge in usage of Bitcoin: View post on Twitter Read all about how BRC-20 tokens work in our explainer: What Are BRC-20 Tokens? Explaining the Bitcoin Memecoin Hype Then there was the launch of Worldcoin by our distinguished AI overlord Sam Altman: View post on Twitter Unsurprisingly/ this did not excite the crypto-native crowd too much: View post on Twitter Why would crypto bros be suspicious of Worldcoin for everyone? Well/ maybe because of the *cough* significant insider allocation: View post on Twitter We’ve seen that movie before. Only problem is/ dumping Worldcoin on plebs could become harder in the future with less exit liquidity. Two market makers quit the game last week: View post on Twitter But even if the casino changes/ sooner or later someone else will show up with an opportunity for players to partake in the never-ending game: View post on Twitter And maybe we will all hail our Worldcoin overlords in the near future/ who knows. Some last-minute additions this week were everyone’s favorite (or second-favorite) crypto swi-/ sorry/ former founder Do Kwon deploying capital to go out on bail: View post on Twitter And Canadian crypto bros will have to cross one option off the list because Binance is leaving the market. Crypto Twitter was not impressed: View post on Twitter Rough week indeed. Time for some laughs now. Memes After last week's bumpy price action/ the least we can do is provide crypto bros with the right tunes. Stay clean and see you next week… View post on Twitter This article contains links to third-party websites or other content for information purposes only (“Third-Party Sites”). The Third-Party Sites are not under the control of CoinMarketCap/ and CoinMarketCap is not responsible for the content of any Third-Party Site/ including without limitation any link contained in a Third-Party Site/ or any changes or updates to a Third-Party Site. CoinMarketCap is providing these links to you only as a convenience/ and the inclusion of any link does not imply endorsement/ approval or recommendation by CoinMarketCap of the site or any association with its operators. This article is intended to be used and must be used for informational purposes only. It is important to do your own research and analysis before making any material decisions related to any of the products or services described. This article is not intended as/ and shall not be construed as/ financial advice. The views and opinions expressed in this article are the author’s [company’s] own and do not necessarily reflect those of CoinMarketCap.","date":"2023-05-15T10:56:50.166Z","tags":"","author":"Ivan Cryptoslav","category":"Crypto News","id":2000009}
,{"link":"https://coinmarketcap.com/academy/article/token-swap-vs-token-migration","websiteSource":"CoinMarketCap","type":"article","summary":"Discover the critical role of token swaps in the crypto ecosystem, and learn the differences between token swaps and migrations in this article.","title":"Token Swap vs Token Migration | CoinMarketCap","detailedContent":"TL;DR: Token swaps involve exchanging one cryptocurrency for another/ usually within the same blockchain. This can be done on centralized or decentralized exchanges. Cross-chain token swaps may occur between two different blockchains and are facilitated by blockchain bridges. Unlike token swaps which can be carried out by individuals/ token migrations are typically done on the project level/ and refers to the process of “moving” a project's tokens from one blockchain to another/ usually due to benefits offered on the new blockchain. Subscribe Join us in showcasing the cryptocurrency revolution/ one newsletter at a time. Subscribe now to get daily news and market updates right to your inbox/ along with our millions of other subscribers (that’s right/ millions love us!) — what are you waiting for? Difference Between Token Migration and Token Swap The cryptocurrency industry has come a long way since Bitcoin’s debut in 2009. Starting with the ICO boom of 2017 to decentralized finance (DeFi)/ non-fungible tokens (NFTs) and decentralized autonomous organizations (DAOs)/ the nascent sector has welcomed a number of innovations. Amid the growing adoption of cryptocurrencies/ one service that has undoubtedly played a crucial role in building the ecosystem is token swap. Although different from token migration/ it is not uncommon for crypto participants to use both terms interchangeably. However/ a token swap is technically different from a token migration. In this article/ we will explore the difference between token swaps and migration. What Is a Token Swap? Otherwise known as a “coin swap/” a token swap is the process of exchanging one token for another token. For example/ when you deposit USDT on a decentralized exchange (DEX) and get ETH in return/ you are conducting a token swap. Token swaps usually happen within the same blockchain. However/ there may be instances where they happen between two different blockchains. This is known as cross-chain token swaps. A cross-chain token swap happens when you move your tokens from one blockchain to another. This is usually facilitated via blockchain bridges/ which lock a token on one blockchain while minting a wrapped version of the token on another. For example/ if you want to spend your ETH on the BNB Smart Chain (BSC)/ you can use the Binance bridge to lock up your Ether on the Ethereum network while you receive wrapped Ether (wETH) tokens on BSC. The same process can be used to unwrap your wETH to receive your ETH back on the Ethereum blockchain. In the case of regular token swaps/ which happen on the same blockchain/ you are essentially selling a token that you already own and buying an equivalent value of another token. Both regular and cross-chain token swaps can be done through a centralized or decentralized exchange/ with each type offering pros and cons. What Is Token Migration? While a token swap essentially involves exchanging one existing token for another/ token migration refers to the process of “moving” tokens from one blockchain to another. It is worth mentioning that in token migration/ the replacement token typically begins to exist based on the execution of the swap. A token migration usually occurs when a project decides to switch to a different blockchain platform/ usually due to the benefits that the new blockchain offers/ such as faster transaction speeds or lower fees. In this process/ the old tokens on the original blockchain are burned or locked up/ and new tokens are created on the new blockchain. Holders of the old tokens are required to migrate their tokens to the new blockchain to receive the new tokens. Unlike token swaps/ which can be performed by an individual holder/ a token migration is typically conducted at a project level. For instance/ it is possible to swap your ETH to AVAX using a CEX. However/ it is not possible for you/ as an individual/ to migrate your tokens from the Ethereum blockchain to Avalanche. At best/ you can use a cross-chain bridge to wrap your tokens/ which is still a token swap. Why Are Token Swaps Important? To put things in perspective/ there are more than 23/000 cryptocurrencies listed on CoinMarketCap today. While some are not active anymore — there are also many that have a thriving ecosystem and active users. Besides being “in for the tech/” one of the main reasons why people get involved in the crypto market is speculation with the anticipation of future returns. Let’s assume you are 100% certain that the price of the hypothetical token “XYZ” will surge to $100/000 by tomorrow. Chances are that you will liquidate your position in other cryptocurrencies to buy more “XYZ”. Similarly/ you’d probably rush to sell all your “ABC” tokens if news breaks that the project is a scam and the founders have absconded. While these are extreme examples/ there are a number of reasons why investors choose to swap their tokens. For one/ they may strongly believe in the future of the project and want to gain exposure to that particular token. Or/ they may need to react quickly to negative news about a particular token in their portfolio. Given the volatile and dynamic nature of the cryptocurrency market/ swapping tokens allow investors to take advantage of the most attractive opportunities. Token swapping allows investors to quickly trade their current token for another. Why Do Projects Conduct Token Migration? It is not usual for blockchain projects to migrate from one blockchain to another. As a matter of fact/ this was a common practice between 2018 and 2020. During the Initial Coin Offering (ICO) boom of late 2017 and early 2018/ thousands of cryptocurrency projects were launched on the Ethereum network/ adopting its ERC-20 token standard. ICO is a fundraising mechanism used by crypto startups. During an ICO/ a new cryptocurrency is created and sold to investors in exchange for existing cryptocurrencies like Bitcoin or Ethereum/ or even fiat currency like USD. In most cases/ these crypto startups promise investors that the issued tokens will have a future use case within their own native blockchain. As a result/ these tokens are transferred/ aka “migrated/” from a blockchain like Ethereum to their own chains upon completion. Think of it as living in a rented apartment temporarily until you save up enough money to buy a house. Examples of Token Migration A number of prominent projects like TRON/ BNB and CRO have conducted mainnet swaps and token migrations in the past/ moving from the Ethereum chain to their own native blockchains. More recently/ internet-of-things protocol Helium successfully migrated its IOT token to the Solana blockchain/ with the goal of making it cheaper and faster to operate on Helium. How To Perform a Token Swap There are generally four ways to conduct a token swap depending on the type. Regular swaps can be done using centralized exchanges like Binance and Coinbase/ decentralized exchanges like Uniswap and PancakeSwap/ or directly within wallet apps like MetaMask and Phantom. Cross-chain token swaps/ on the other hand/ require blockchain bridges. Some popular examples are Celer cBridge/ AnySwap/ Cross-Chain Bridge/ Multichain/ Portal Token Bridge (formerly Wormhole)/ Synapse/ Hop Protocol/ Stargate Finance and more. How To Perform a Token Migration Remember that a token migration cannot be conducted at an individual level. This decision needs to first come from the developers of the project/ and they will decide how the token migration process should go. There are several ways this can play out. You may be required to handle the token migration process by yourself if you self-custody the tokens. This doesn’t necessarily mean that you need to have any background in tech. User experience in the crypto space has improved significantly over the past few years and migrating a self-held token can be as easy as just a few clicks. Most projects will create tools to assist holders with the migration process. Other projects may decide to take a snapshot of the wallets of token holders and automatically airdrop the replacement tokens on the succeeding chain. This approach does not require any active participation from token holders. Alternatively/ if your tokens are held on a centralized exchange/ there is a high probability that the exchange will handle the token migration process on your behalf. Conclusion Although it may be used interchangeably/ a token swap is quite different from a token migration. While a token swap involves selling or locking up one asset to purchase another asset/ token migration is the transfer of tokens from one blockchain to another. Furthermore/ token swaps are conducted at an individual level while migrations are carried out at a project level. This article contains links to third-party websites or other content for information purposes only (“Third-Party Sites”). The Third-Party Sites are not under the control of CoinMarketCap/ and CoinMarketCap is not responsible for the content of any Third-Party Site/ including without limitation any link contained in a Third-Party Site/ or any changes or updates to a Third-Party Site. CoinMarketCap is providing these links to you only as a convenience/ and the inclusion of any link does not imply endorsement/ approval or recommendation by CoinMarketCap of the site or any association with its operators. This article is intended to be used and must be used for informational purposes only. It is important to do your own research and analysis before making any material decisions related to any of the products or services described. This article is not intended as/ and shall not be construed as/ financial advice. The views and opinions expressed in this article are the author’s [company’s] own and do not necessarily reflect those of CoinMarketCap.","date":"2023-05-09T13:34:35.685Z","tags":"","author":"Andrey Sergeenkov","category":"Crypto Basics","id":2000010}
,{"link":"https://coinmarketcap.com/academy/article/last-week-on-crypto-twitter-memecoin-mania","websiteSource":"CoinMarketCap","type":"article","summary":"Memecoin euphoria takes over crypto, even extending to — yes, that's right — Bitcoin. Check out our weekly CT roundup!","title":"Last Week on Crypto Twitter: Memecoin Mania | CoinMarketCap","detailedContent":"Gm/ What a week it’s been. memecoins are so back. They are back to the extent that they have broken Crypto Twitter/ Ethereum and Bitcoin. Let us explain… Whose Threads Are a Must-Read? So. You may or may not remember this round-up mentioning PEPE for the first time two weeks ago. It had already printed millionaires back then. But now we’re in memecoin frenzy mode. All-out mania. People are even suggesting a memecoin supercycle: View post on Twitter You read that absolutely right. No more complicated ponzis. No more DeFi/ L1/ infrastructure vaporware VC shenanigans. Adjust investments to the IQ of Tiktokers. Whether they like it or not/ Bitcoiners are now part of the memecoin madness too. Ordinals were the test case. They are at an all-time high volume/ as this thread about Bitcoin Ordinals analytics explains: View post on Twitter The market’s already in the next state of mania and moved on to BRC-20 shitcoins/ ehhh altcoins/ that is. Needless to say that explosive growth is a bit of an understatement for this situation. So redphone is probably right when he suggests the next bull cycle being the most explosive one yet: View post on Twitter Imajin if people actually started caring about Dapps and all that other stuff on the blockchain no one uses. We could be in for the ponzi singularity. Now if you missed PEPE or just don’t trade memecoins/ you may be better off tailing the smart people who do. Someone checked the chain and there are wallets that bought both PEPE and SHIB early: View post on Twitter Might want to bookmark these three addresses. Was there anything else worth talking about other than memecoins and their effects? Not really. But Jason Lowery had a nice thread about why Bitcoin is a great tool for national cybersecurity: View post on Twitter Ok yea/ Jason/ nice. But hear us out: altcoins on the Bitcoin blockchain. Wisdom of the Week Lots of wisdom in the timeline last week. One nugget came from Hsaka: View post on Twitter You can (or don't want to) never leave indeed. This is most probably not the last memecoin mania either. If you missed this one/ don’t beat yourself up. Because it’s not about the millions. Who Is Arguing in Way Too Public a Place? Another week/ another memecoin rug. This time WSB Coin was on the end of some drama: View post on Twitter As it always goes/ out came the pitchforks and doxxing threats: View post on Twitter How did this one end? Apparently with funds recovered. Good for them: View post on Twitter Elon Building Twitter Surely/ with all this madness going on/ Elon would put on his memecoin shitlord suit and jump right in? Nope! A really quiet week for Chief Twit. No drama/ no major Twitter updates/ no crypto. Just Elon enjoying some family time at the F1 race: View post on Twitter Just kidding/ how could Elon not cause a memecoin to pump? He replied to Beeple’s incomprehensible tweet/ causing GPT-created memecoin TURBO to pump: View post on Twitter Talk of the Town Ok. So. Uhm/ where do we start here… We covered this entire Pepe-to-the-moon story in an extra article: Is Memecoin Szn Back? But that was last Wednesday. So now it’s time for an update and/ obviously/ everyone wants to know: wen short? Well/ the top may or may not be already in. Jack Niewold thinks it’s not: View post on Twitter PEPE is a wonderful reminder about what crypto stands for: View post on Twitter Imagine this: PEPE even started onboarding those people to DeFi that refused to use its infrastructure for years. Like millionaire crypto influencers: View post on Twitter Crazy/ isn’t it? But still/ there are some good people left in crypto- People with integrity that do not put money first. People like jaredfromsubway.eth: View post on Twitter This memecoin tsunami is so strong/ it even washes over Bitcoin dinosaurs and laser eye maxis that want to keep the chain clean of nasty “transactions.” Yes/ that really happened: View post on Twitter Bitcoiners are in shock and disbelief over this DDoS attack: View post on Twitter The horror! Someone is *gasp* using Bitcoin. Binance temporarily suspended withdrawals to cope with this onslaught of usage. That makes the proposed tax on Bitcoin miners even more lucrative: View post on Twitter Now that everyone has submitted to the Pepe standard and we agree money isn’t real/ it doesn’t matter if we burn millions/ right? Then we can consider Balaji a foreward-thinking pioneer: View post on Twitter Memes The memes were pretty obvious last week. But everyone who was watching it from the sidelines did not have a lot of fun: View post on Twitter Business and finance classes on Twitter are far superior to boring university alternatives: View post on Twitter Leaving you with the overall sentiment of this market: View post on Twitter See you next week! This article contains links to third-party websites or other content for information purposes only (“Third-Party Sites”). The Third-Party Sites are not under the control of CoinMarketCap/ and CoinMarketCap is not responsible for the content of any Third-Party Site/ including without limitation any link contained in a Third-Party Site/ or any changes or updates to a Third-Party Site. CoinMarketCap is providing these links to you only as a convenience/ and the inclusion of any link does not imply endorsement/ approval or recommendation by CoinMarketCap of the site or any association with its operators. This article is intended to be used and must be used for informational purposes only. It is important to do your own research and analysis before making any material decisions related to any of the products or services described. This article is not intended as/ and shall not be construed as/ financial advice. The views and opinions expressed in this article are the author’s [company’s] own and do not necessarily reflect those of CoinMarketCap.","date":"2023-05-08T14:12:03.566Z","tags":"","author":"Ivan Cryptoslav","category":"Crypto News","id":2000011}
,{"link":"https://coinmarketcap.com/academy/article/what-are-multi-party-computation-mpc-wallets","websiteSource":"CoinMarketCap","type":"article","summary":"Dive into the world of multi-party computation (MPC) wallets, understand how they work, their benefits, risks, top options, and how to choose the right one for secure crypto storage.","title":"What Are Multi-Party Computation (MPC) Wallets? | CoinMarketCap","detailedContent":"Multi-party computation (MPC) wallets are not exactly a topic that comes up often in crypto. Even though they are highly technical/ it is still useful to understand how these wallets work and what their use cases are. TL;DR: \"Multi-Party Computation\" (MPC) wallets are an innovation in crypto storage/ using cryptographic protocols to split and distribute private keys among multiple parties securely without revealing them to others. Private keys are split into “shares” and distributed to each party that has control over the wallet/ ensuring that no single party can control the wallet. Transactions can be authorized by multiple shares/ not all/ enhancing the security and availability of the wallet/ while eliminating single points of failure. MPC wallets differ from single-key/ multi-signature or hardware wallets/ and have benefits as well as risks. Subscribe Join us in showcasing the cryptocurrency revolution/ one newsletter at a time. Subscribe now to get daily news and market updates right to your inbox/ along with our millions of other subscribers (that’s right/ millions love us!) — what are you waiting for? What Are Multi-Party Computation (MPC) Wallets? Multi-party computation wallets are crypto wallets using MPC technology to manage and store users’ assets securely. MPC is a cryptographic protocol that allows multiple parties to perform computations on their data without revealing it to each other or a third party. For example/ three parties can calculate their average salary without disclosing their individual salaries. While the concept of MPC has been around since the 80s/ it has only entered the crypto space in recent years/ allowing wallet providers and custodians to securely store crypto assets. In an MPC wallet/ the private keys which users require to access and manage their crypto assets are split into multiple parts known as \"shares\". These are subsequently distributed among the parties involved in the MPC protocol. As a result/ no single party can control or compromise the wallet. Moreover/ transactions can be authorized by attaining a required threshold of shares instead of requiring all or none of the shares. This eliminates a single point of failure and enhances the security and availability of the wallet. How MPC Wallets Differ From Regular Wallets MPC wallets differ from regular wallets such as single-key/ multi-signature or hardware wallets. Single-key wallets rely on one private key that can be easily lost or stolen. Hence/ MPC wallets are more secure in that regard. Multi-signature wallets require multiple signatures from different devices or parties which can make the process cumbersome or affect the availability of the wallet in time-sensitive situations. Moreover/ MPC wallets are protocol-agnostic and maintain the signers' privacy. They're also cheaper since only one transaction signature is necessary. Finally/ hardware wallets depend on physical devices that can be damaged. They are also not suited for use cases where more than one participant is required to authorize transactions. Benefits of MPC Wallets MPC wallets offer several benefits/ such as: Decentralization MPC wallets do not require any trusted third party to store or access the private keys/ as they are distributed among the multiple parties involved in the MPC protocol. This reduces the risk of centralization/ corruption or collusion that may compromise the security or availability of the stored assets. Data Privacy MPC wallets protect the users' data privacy too/ as they do not reveal any private information or secret data to each other or to a third party. This ensures that no one can access or tamper with the users’ data without their consent or knowledge. High Accuracy MPC wallets also provide high accuracy for different computations using cryptography. This means they can perform complex operations such as generating addresses/ signing transactions and verifying signatures without errors or inconsistencies. Removes Single Points of Failure MPC wallets eliminate single points of failure that may exist in other types of wallets/ such as single-key/ multi-signature or hardware wallets. These types of wallets may suffer from loss or theft of private keys/ unavailability of key parties/ malfunction of devices/ or hacking or phishing attacks. MPC wallets overcome these challenges by splitting and distributing the private keys among the multiple parties involved in the MPC protocol. Scalability MPC wallets enable scalability by allowing users to add or remove parties from the MPC protocol without affecting its functionality. Users can adjust their security and performance levels according to their needs and preferences. For example/ users can increase their security by adding more parties to the protocol. Flexibility MPC wallets offer increased flexibility by enabling dynamic policies and workflows for managing digital assets. Users can set different thresholds for authorizing transactions depending on various factors such as amount/ frequency/ destination address and more. Users can modify these thresholds at any time without affecting existing transactions/ and create contingency plans in case any of the required parties become unavailable. Compliance MPC wallets support compliance with global regulations and industry standards for digital asset custody. Users can comply with Anti-Money Laundering (AML) and Know Your Customer (KYC) requirements by verifying identities and sources of funds before initiating transactions They can also adhere to audit and reporting obligations by providing transparent records and logs of transactions/ as well as follow industry best practices for security and governance through their policies and procedures. Risks of MPC Wallets MPC Wallets also have some risks you should be aware of/ such as: High Communication Costs MPC wallets require a lot of communication between the parties involved in the MPC protocol. This can increase the bandwidth usage and the network latency of the devices involved in the process. It can also expose them to network attacks such as denial-of-service (DoS) or man-in-the-middle (MITM) attacks. Technical Complexity MPC wallets rely on advanced cryptographic techniques and distributed computing that are hard to understand and implement correctly. This can lead to bugs/ errors or vulnerabilities in the code or the protocol that can compromise the security or functionality of the wallet. Not Open-Source or Interoperable Most conventional wallets like Ledger and Trezor are incompatible with MPC wallets. MPC algorithms are not standardized and the solutions are not open-source/ which makes them difficult to use for retail customers. Popular MPC Wallets Some of the popular MPC wallets include: ZenGo ZenGo is one of the most popular and user-friendly MPC wallets for individuals and small teams. It offers buying and selling crypto with fiat/ biometric authentication/ backup and recovery features/ 24/7 live customer service/ supports over 70 different cryptocurrencies/ and allows users to use their favorite decentralized applications (DApps) through Wallet Connect. Fireblocks Fireblocks is one of the most trusted and secure MPC wallets for institutional investors. It supports over 40 blockchain protocols and 1/100 tokens and integrates with major exchanges and protocols. It also offers enterprise-grade security features such as insurance coverage up to $150 million per wallet/ multi-factor authentication/ role-based permissions and audit logs. Coinbase Coinbase/ one of the largest and most well-known crypto centralized exchange (CEX) platforms/ also offers an MPC wallet solution for institutional clients. It supports over 90 cryptocurrencies and provides access to the Coinbase Pro trading platform. Qredo Qredo is a new and innovative MPC wallet platform enabling institutional investors cross-chain liquidity. It supports over 20 blockchain protocols and allows users to transfer assets across different blockchains without intermediaries or fees. It also offers advanced security features such as decentralized governance and atomic settlement. How To Choose an MPC Wallet An MPC wallet will not be for most users. But in the event that you choose to get one/ you should keep the following two tips in mind: 1. Know your use case Different MPC wallets cater to different types of users/ such as individuals/ small teams or institutional users. Depending on your use case/ you may have different requirements for security/ performance/ functionality and cost. 2. Compare features and services Different MPC wallets offer different features and services that can enhance your crypto experience. For example/ some MPC wallets offer buying and selling crypto with fiat/ biometric authentication or more granular access controls. Compare the features and services of different MPC wallets and see which ones match your preferences and goals. This article contains links to third-party websites or other content for information purposes only (“Third-Party Sites”). The Third-Party Sites are not under the control of CoinMarketCap/ and CoinMarketCap is not responsible for the content of any Third-Party Site/ including without limitation any link contained in a Third-Party Site/ or any changes or updates to a Third-Party Site. CoinMarketCap is providing these links to you only as a convenience/ and the inclusion of any link does not imply endorsement/ approval or recommendation by CoinMarketCap of the site or any association with its operators. This article is intended to be used and must be used for informational purposes only. It is important to do your own research and analysis before making any material decisions related to any of the products or services described. This article is not intended as/ and shall not be construed as/ financial advice. The views and opinions expressed in this article are the author’s [company’s] own and do not necessarily reflect those of CoinMarketCap.","date":"2023-05-05T09:12:45.057Z","tags":"","author":"Ivan Cryptoslav","category":"Crypto Basics","id":2000012}
,{"link":"https://coinmarketcap.com/academy/article/what-is-address-poisoning-attack-and-how-to-stay-safe","websiteSource":"CoinMarketCap","type":"article","summary":"Don't let address poisoning attacks ruin your day! Keep your coins safe from this new sneaky crypto scam!","title":"Address Poisoning Attacks: What They Are and How To Stay Safe | CoinMarketCap","detailedContent":"In early 2023/ a new type of cryptocurrency attack rose to prominence/ known simply as “address poisoning.” The premise of the attack is simple: trick the target into sending funds to the attacker's address by forming transactions designed to confuse the target. The attack was first spotted in December 2022 but has since grown dramatically in frequency/ with somewhere in the order of $5 to $10 million lost to the scam — a number still growing to this day. At least $2.8 million has been stolen from users on BNB Chain/ the majority of which is in the form of USD Coin (USDC) or Tether (USDT). At least 1/000 unique users have now fallen victim to the attack. Most major blockchains are now being used to carry out the attack. To date/ tens of millions of active addresses have been targeted by address poisoning attacks. There are several ways this scam is orchestrated. We’ll cover two of the most common below. Method 1: Fake Contracts In the first example/ the attacker creates a smart contract that sends tokens with zero amounts to an address that is similar to the victim's address. The first time the victim sees this transaction/ they may not pay much attention to it. However/ the next time the victim tries to make a legitimate transfer/ they may inadvertently copy the phishing address from the transaction history on Etherscan or their wallet app/ instead of the intended recipient address. This mistake results in the victim transferring their cryptocurrency to the attacker's address. This address is designed to closely match the victim’s/ with the first (and often last) several characters matching exactly. These are typically the only characters shown by wallets and explorers for brevity purposes. As such/ most people only know the first and last few characters of their wallet. In some variations of this scam/ the attacker uses a fake token contract and transfers a significant sum of said token to the target. This will usually be a fake version of a popular token/ such as USDT or USDC. The attacker can then use a transaction that calls this token contract's transferFrom function to make it appear that the target address transfers 0 of these tokens to the receiver (the attacker's address). This is used to increase the odds that the victim will copy the last receiver's address/ believing that they have already transacted with this address in the past. Some block explorers now hide these transactions by default/ but many in-app transaction logs and explorers will still show these transactions. View post on Twitter Method 2: Breadcrumbing In the second example/ the attacker creates a vanity address that is very similar to the victim's address. They then send very small amounts of cryptocurrency to the victim's address/ hoping that the victim will check the balance on a block explorer and see the attacker's address in the transaction history. The attacker hopes that when you see a transaction for a token you typically interact with in your transaction history/ you might copy the recipient address (thinking it is your own) and then send funds to that address. As you might expect/ sending a small amount of funds to thousands of wallets can be expensive. In total/ attackers have spent millions of dollars in transaction fees carrying out attacks on the Ethereum blockchain alone. These attacks can be difficult to detect because the transactions appear legitimate and may not trigger any warnings. However/ victims can protect themselves by always double-checking the recipient's address before sending any cryptocurrency. How To Stay Safe From Address Poisoning Attacks? Unfortunately/ there is nothing you can do to prevent yourself from being targeted by an address poisoning attack. The attackers tend to target anybody that transacts regularly and/or frequently sends or receives large sums. If you find yourself the victim of an address poisoning attack/ your best course of action is to simply arm yourself with an understanding of how they work so that you don’t fall victim to one. Then/ it’s best to simply ignore transactions associated with address poisoning attacks. Besides this/ there are a handful of transaction hygiene practices you can follow to minimize your chances of being duped. These include: Set up alerts: Several tools allow you to set up alerts to notify you when your address transacts or interacts with specific smart contracts. These can be used to confirm your usual transactions (allowing you to ignore anything else) or flag suspicious transactions involving your address. Create a contact list: Address poisoning attacks work by tricking you into sending funds to a wallet that you think is your own or somebody you transact with regularly. You can completely eliminate the risk of falling victim to this attack by adding wallets you regularly transact with to your contact list. Almost every major cryptocurrency wallet now has a contact list or address book. Use a trusted source: Use a trusted source to obtain the recipient's address. This could include using an official website/ social media account or other verified communication channels. Avoid clicking on links or using addresses obtained from untrusted sources/ and never use previous transactions to identify the recipient's address without double-checking first. Use a name service: Name service addresses such as those provided by the Ethereum Name Service (ENS) or BSC Name Service (BNS) can provide an additional layer of protection since they are impossible to duplicate and their short length makes them much harder to spoof. For a more technical solution/ some Web3 wallets allow you to filter transactions by contract address or whitelist only specific contract addresses. You can then find the official contract address for your target tokens on its CoinMarketCap coin detail page. Popular options include MyEtherWallet (MEW) and Exodus. Many block explorers will automatically label these transactions as suspicious or as likely phishing attacks/ but this generally takes some time. As such/ it’s not a reliable way to determine if a transaction is an address-poisoning attack — particularly if the transaction is very recent. This article contains links to third-party websites or other content for information purposes only (“Third-Party Sites”). The Third-Party Sites are not under the control of CoinMarketCap/ and CoinMarketCap is not responsible for the content of any Third-Party Site/ including without limitation any link contained in a Third-Party Site/ or any changes or updates to a Third-Party Site. CoinMarketCap is providing these links to you only as a convenience/ and the inclusion of any link does not imply endorsement/ approval or recommendation by CoinMarketCap of the site or any association with its operators. This article is intended to be used and must be used for informational purposes only. It is important to do your own research and analysis before making any material decisions related to any of the products or services described. This article is not intended as/ and shall not be construed as/ financial advice. The views and opinions expressed in this article are the author’s [company’s] own and do not necessarily reflect those of CoinMarketCap. CoinMarketCap is not responsible for the success or authenticity of any project/ we aim to act as a neutral informational resource for end-users.","date":"2023-05-04T03:22:31.161Z","tags":"","author":"Daniel Phillips","category":"Crypto Basics","id":2000013}
,{"link":"https://coinmarketcap.com/academy/article/coin-vs-token:-what-is-the-difference","websiteSource":"CoinMarketCap","type":"article","summary":"Coins versus tokens — just two sides of the same crypto coins? Not quite — learn the difference between these two terms.","title":"Coin vs Token: What Is the Difference?  | CoinMarketCap","detailedContent":"One of crypto's fundamental questions no one is talking about: Why is it Dogecoin and not Dogetoken? No one is honest enough to admit they don't know the difference. Probably not a coin-cidence. Ok/ that's enough silly jokes. The difference between coins and tokens is probably clear to many. But if you're reading this article/ you may not know it. So we'll clear it up for you: What are coins and what are tokens? The difference between coins and tokens. Examples of coins and tokens. Subscribe Join us in showcasing the cryptocurrency revolution/ one newsletter at a time. Subscribe now to get daily news and market updates right to your inbox/ along with our millions of other subscribers (that’s right/ millions love us!) — what are you waiting for? What Is a Coin? Coins are cryptocurrencies belonging to a blockchain. They are independent of other chains and cannot be used on other chains in their native form. The use cases of coins are: Medium of exchange Store of value Unit of account Some of the most popular coins are Bitcoin/ Ethereum and Dogecoin. Read also: Can Bitcoin become money? A coin is produced through mining/ meaning (in its easiest form) computers solve complex math puzzles and validate transactions to produce coins. The first computer to solve the problem gets rewarded with newly minted coins. This ensures that the network is secure and decentralized. Some of the characteristics and benefits of coins are: Decentralization: Coins are not controlled by any central authority or intermediary. They are governed by the rules of their protocol and the consensus of their community. This gives users more freedom and privacy over their transactions and funds. Security: Coins are protected by cryptography and encryption. They are resistant to hacking/ censorship and fraud. Users can trust that their coins are safe and authentic/ without relying on third parties. Scarcity: Most coins have a limited supply that is predetermined by their algorithm. This creates a deflationary effect that increases its value over time. For example/ Bitcoin has a total supply of 21 million and Ethereum is deflationary. However/ not all coins are scarce/ such as Dogecoin/ which has no cap on its supply. Coins are like digital commodities. Read our explainer about digital commodities to understand how they work. Coins can vary based on how they are created/ their value and the function they fulfill. Here are some examples of coin types: Native Coins: These are coins that run on their own blockchain and serve as the main currency of the network. Examples include Bitcoin (BTC)/ Ethereum (ETH) and Litecoin (LTC). Forked Coins: These are coins that are derived from an existing blockchain by splitting or branching off from it. Examples include Bitcoin Cash (BCH)/ Bitcoin SV (BSV) and Ethereum Classic (ETC). Wrapped Coins: These are coins that represent another asset on a different blockchain. They allow users to access cross-chain functionality and liquidity. Examples include Wrapped Bitcoin (WBTC)/ Wrapped Ether (WETH). Stablecoins: These are coins that are pegged to the value of another asset/ such as fiat currency or gold. They aim to provide price stability and reduce volatility. Examples include Tether (USDT)/ USD Coin (USDC). What Is a Token? Tokens sit on top of an existing blockchain and depend on it for their operation. A token can represent various things/ such as utility/ governance rights/ shares of ownership or others. Tokens are usually “pre-mined/” meaning developers use a smart contract to issue new tokens and distribute them to users. Some of the characteristics and benefits of tokens are: Utility: Tokens are necessary to use the decentralized applications (dApps) they are built for. Users can use tokens to pay for fees/ perform actions/ or receive benefits. Governance: Tokens can give users a voice in the decision-making process of the blockchain or dApp. Users can use tokens to vote on proposals/ changes/ or upgrades. Interoperability: Tokens can enable cross-chain communication and compatibility. Unlike coins/ tokens can be supported by different blockchains. Tokens are like digital currency for the protocol offering them. They can grant users access/ rights or rewards. There are different types of tokens based on their function/ value proposition/ use cases/ etc. Here are some examples of token types: Utility Tokens: They provide access to a service or function on the blockchain or dApp. Examples include Uniswap (UNI) and Chainlink (LINK). Governance Tokens: They give users a say in the governance of the blockchain or dApp. Examples include Maker (MKR)/ Compound (COMP)/ Aave (AAVE)/ and most other tokens. Security Tokens: They represent a share of ownership or a claim on an asset or income stream. They are subject to securities regulations and compliance. Examples include Polymath (POLY). Non-fungible Tokens (NFTs): They represent unique and indivisible digital items/ such as art and collectibles. They are not interchangeable and have varying values. Examples include CryptoPunks and Bored Apes. Coins vs Tokens: The Difference Now that we know what coins and tokens are/ let's see how they differ from each other. Here is a feature-by-feature comparison of coins and tokens: Coins are more suitable for general transactions and value preservation/ while tokens are more suitable for specific purposes and value creation. However/ this does not mean that coins and tokens are mutually exclusive or incompatible. In fact/ they can work together and complement each other in the crypto ecosystem. For example: Users can use coins to buy tokens or use tokens to pay for fees on coin networks. Users can wrap coins into tokens or unwrap tokens into coins to access cross-chain functionality and liquidity. Users can stake coins or tokens to earn rewards or participate in governance. Users can swap coins or tokens with each other using decentralized exchanges (DEXs) or automated market makers (AMMs). Popular Coins and Tokens Let's talk about some popular crypto coins and tokens. Popular Crypto Coins Bitcoin (BTC): Bitcoin was the first cryptocurrency and thus the first coin. It has risen to popularity/ thanks to it being the most secure and decentralized network/ with thousands of nodes and miners around the world. Read also: Is Bitcoin the next world reserve currency? Ethereum (ETH): Ether is the coin of the Ethereum blockchain. It fulfills the same function as a medium of exchange and unit of account as Bitcoin. Unlike Bitcoin/ Ethereum allows for smart contract functionality and the development of decentralized applications (DApps). Read also: Everything you need to know about the Shanghai Upgrade. Binance Coin (BNB): Binance Coin can be used to pay for discounted trading fees/ participate in token sales/ and access various services and functions in the Binance ecosystem. It also has a limited supply that is periodically burned/ creating a deflationary effect that increases its value over time. Read also: Binance Marketplace: the new crypto super app. Dogecoin (DOGE): Doge is based on the image of a Shiba Inu dog and has a loyal and enthusiastic fan base. It is often used for tipping/ donating or expressing support on social media platforms. It is also famous for Elon Musk being its unofficial champion and most famous supporter. Read also: Elon changes Twitter logo to Doge Popular Crypto Tokens Tether (USDT): Tether is the biggest stablecoin/ meaning its value is bound to the value of the dollar. It aims to provide price stability and reduce volatility in the crypto market. It is often used as a medium of exchange or a store of value between different cryptocurrencies or platforms. Read also: Why do stablecoins depeg? Uniswap (UNI): UNI is the governance token of the Uniswap protocol. Uniswap is a decentralized exchanged for swapping tokens between different EVM-compatible blockchains. Read also: Uniswap vs PancakeSwap Arbitrum (ARB): ARB is the governance token of Arbitrum/ a layer-two blockchain for Ethereum. Arbitrum was created by the Arbitrum Foundation and launched with one of the biggest airdrops in the history of cryptocurrency. Read also: Arbitrum vs Optimism: The Ultimate Comparison This article contains links to third-party websites or other content for information purposes only (“Third-Party Sites”). The Third-Party Sites are not under the control of CoinMarketCap/ and CoinMarketCap is not responsible for the content of any Third-Party Site/ including without limitation any link contained in a Third-Party Site/ or any changes or updates to a Third-Party Site. CoinMarketCap is providing these links to you only as a convenience/ and the inclusion of any link does not imply endorsement/ approval or recommendation by CoinMarketCap of the site or any association with its operators. This article is intended to be used and must be used for informational purposes only. It is important to do your own research and analysis before making any material decisions related to any of the products or services described. This article is not intended as/ and shall not be construed as/ financial advice. The views and opinions expressed in this article are the author’s [company’s] own and do not necessarily reflect those of CoinMarketCap. CoinMarketCap is not responsible for the success or authenticity of any project/ we aim to act as a neutral informational resource for end-users.","date":"2023-04-24T09:37:54.451Z","tags":"","author":"Ivan Cryptoslav","category":"Crypto Basics","id":2000014}
,{"link":"https://coinmarketcap.com/academy/article/last-week-on-crypto-twitter-down-we-go-again","websiteSource":"CoinMarketCap","type":"article","summary":"Markets dumped but Crypto Twitter never fails to deliver — check out what went down on CT the past week.","title":"Last Week on Crypto Twitter: Down We Go Again | CoinMarketCap","detailedContent":"Gm/ Could the bull market party of 2023 be over (for now)? Here’s what’s not over: The good/ the bad/ and the ugly of Crypto Twitter. This week we have shilling rappers/ ended relationships/ and hardware wallets stored in hard-to-believe places. Strap in/ a short but hard-hitting round-up of Crypto Twitter’s interesting last week. Whose Threads Are A Must-Read? A bit of a quiet week on the thread front/ but there were still a few gems. Emperor Osmo reminded us that the Cosmos ecosystem/ the overlooked wallflower among L1s/ is still there and building. He wrote up a thread of 15 reasons to be bullish on it: View post on Twitter There are a bunch of appchains launching on Cosmos and it boasts a strong security model. Is that going to be enough for a pump? Probably not in the short run but who knows what could happen in the next bull market. Read also our Deep Dive Into the Cosmos Ecosystem to learn more about it. Tokens that definitely do pump are those the Korean market bids for. Miles Deutscher came in with a handy thread about how to spot Korea pumps early: View post on Twitter Even when the market goes sideways/ there are opportunities to profit when you’re early. But how do you know when we’re just crabbing sideways and when it’s a dip in a bull market? Zero Ika explains it all in his thread about market structures and how to spot them: View post on Twitter Try spotting what kind of market we’re in now (pro-tip: there’s no right answer). Finally/ Crypto Twitter OG punk6529 came in with a massive story thread about collecting art. Well/ not only about collecting art but about the art and science of collecting and when to buy: View post on Twitter A wonderful thread that should give you insight into how whales operate when buying assets. Wisdom Of The Week Some people wonder whether crypto isn’t just greater fool's investment. Maybe. But definitely not all of crypto. Degenerate Spartan summarized how crypto investing works in this handy chart: View post on Twitter Laugh all you want but right-curvers and left-curvers agree. Submit to the narrative if you want to be rewarded. Elon Building Twitter Elon took a well-deserved break from drama and shitposting and mostly focused on the launch of a new SpaceX starship last week. But it wasn’t all rocket launches. He didn’t miss the obligatory dig at a publicly funded broadcaster: View post on Twitter Talk of the Town The talk of the town last week was undoubtedly the grilling of Gary Gensler at the congressional hearing. Our man Gary got roasted: View post on Twitter If you missed it/ we wrote a full breakdown of how Gary Gensler got grilled and what that means for the crypto industry. But that was not the only amusing thing last week. Another big shot/ or at least former big shot/ of the crypto industry took the protection of his coins to another level. Exhibit A/ Do Kwon’s hardware wallet security: View post on Twitter No/ never a dull week in crypto. But prices didn’t dump because they excavated coins from Do Kwon’s you know what. In fact/ Justin Sun suspects there is another reason for that: View post on Twitter Either way/ one surefire way to never have to rely on market prices is spinning up your own NFT or shitcoin scam. Rappers like Soulja Boy have caught on to this fact. But he didn’t have ZachXBT on his radar: View post on Twitter But Soulja Boy isn’t the only one cashing in on a scam. So did this lucky buyer of PEPE last week/ printing a cool million from only 250 quid: View post on Twitter Yes/ sometimes you can win in the casino. As long as you remember that in the end/ it’s always the house that wins. Cause turns out that PEPE is just another version of an insider scam that was thrown up as a pump and dump: View post on Twitter No/ it definitely does not get boring in this space. It’s so interesting that now France wants to join in on the fun and launched their own ERC-20 stablecoin on Ethereum. It just needs a few improvements in terms of the code… View post on Twitter Oh/ and a new Hayes piece dropped as well. Arthur analyzed de-dollarization and whether it’s really happening: View post on Twitter Our Favorite Coinfession Most in the crypto space will not be able to relate to this: View post on Twitter Memes There is “down bad” and there is being down astronomically on NFT Twitter. Like this guy: View post on Twitter Next week is the last before “sell in May and go away.” You bet it’s not going to be a quiet one. See you then! This article contains links to third-party websites or other content for information purposes only (“Third-Party Sites”). The Third-Party Sites are not under the control of CoinMarketCap/ and CoinMarketCap is not responsible for the content of any Third-Party Site/ including without limitation any link contained in a Third-Party Site/ or any changes or updates to a Third-Party Site. CoinMarketCap is providing these links to you only as a convenience/ and the inclusion of any link does not imply endorsement/ approval or recommendation by CoinMarketCap of the site or any association with its operators. This article is intended to be used and must be used for informational purposes only. It is important to do your own research and analysis before making any material decisions related to any of the products or services described. This article is not intended as/ and shall not be construed as/ financial advice. The views and opinions expressed in this article are the author’s [company’s] own and do not necessarily reflect those of CoinMarketCap.","date":"2023-04-24T09:11:22.832Z","tags":"","author":"Ivan Cryptoslav","category":"Crypto News","id":2000015}
,{"link":"https://coinmarketcap.com/academy/article/what-is-an-application-specific-blockchain-appchain","websiteSource":"CoinMarketCap","type":"article","summary":"CoinMarketCap Academy takes a deep dive into appchains — blockchains that are designed to operate a specific application.","title":"What Is an Application-Specific Blockchain (AppChain)? | CoinMarketCap","detailedContent":"In the fast-moving world of blockchain scaling/ appchains are one of the new contenders to help everyone make it to a decentralized utopia. But what are they and where do they come from? It can get technical with appchains/ but that’s what you have CoinMarketCap Academy for. Here's what you will learn in this article: What is an appchain and how does it work? What blockchains use appchains? A comparison of appchains to other blockchain solutions. What are some of the most popular appchains in the market? Subscribe Join us in showcasing the cryptocurrency revolution/ one newsletter at a time. Subscribe now to get daily news and market updates right to your inbox/ along with our millions of other subscribers (that’s right/ millions love us!) — what are you waiting for? What Is an AppChain and How Does It Work? An appchain is a blockchain designed for a specific application. It can be seen as a specialized layer-1 solution that connects to a general layer-0 solution. The layer-0 solution provides the basic infrastructure and interoperability for the appchains/ while the appchains provide the customized functionality and performance for the apps. The benefit of appchains is greater freedom and control for developers. Additionally/ they inherit the security and scalability of the layer-0 they are connected to. Blockchain ecosystems may choose an appchain architecture for different reasons. Scalability Applications do not have to compete for block space in an appchain system. This improves the performance and throughput of the applications/ as well as reduces the congestion and fees on the main network. Customization In an appchain system/ developers are free to choose a consensus mechanism/ governance structures and economic models. This gives developers more freedom and creativity to design their applications. Interoperability Applications can communicate and exchange value across the broader ecosystem/ thanks to common protocols and standards. This creates a more connected and diverse ecosystem of applications. Innovation Developers are free to experiment with new economic and governance models without adversely impacting the main chain. This fosters a more dynamic and collaborative environment for development. Which Blockchains Use AppChains? There are different ways to implement appchains/ but two of the most prominent examples are Cosmos and Polkadot. Cosmos works as the “internet of blockchains” with the Cosmos SDK and the Tendermint consensus mechanism at its core. Appchains are called “zones” and connect to the Cosmos main chain/ creating an interconnected web of chains. Some examples of appchains built on Cosmos are: Akash Network: A decentralized cloud computing platform that leverages unused computing capacity to provide affordable and censorship-resistant cloud services. Osmosis: A decentralized exchange platform that allows users to create and trade custom liquidity pools across different zones. Another example is Polkadot/ which also uses a network of heterogeneous blockchains. These so-called parachains are connected to the Relay Chain/ the central chain of the Polkadot network. Similar to Cosmos/ this results in shared security without sacrificing scalability. It also facilitates the exchange of value for parachains. Some examples of appchains built on Polkadot are: Acala: A decentralized finance hub that offers a multi-collateralized stablecoin/ a trustless staking derivative/ and a decentralized exchange platform. Litentry: A cross-chain identity aggregator/ which offers decentralized identity verification and reputation management. Comparing AppChains to Other Blockchains Appchains typically focus on one application in a wider web of blockchains. How does this compare to other blockchain architectures? Appchains vs Monolithic Chains Monolithic chains are all-in-one solutions where all functionality/ including applications/ is executed on the base layer. Examples of monolithic chains include Bitcoin and Ethereum 1.0. These types of chains have several advantages: Simplicity: Monolithic chains don't rely on external parties or protocols to operate/ reducing network complexity. Security: With a smaller attack surface/ monolithic chains generally offer greater security. Decentralization and Immutability: All nodes follow the same rules and validate the same transactions/ ensuring a high degree of decentralization. However/ monolithic chains also come with significant disadvantages: Scalability: Limited resources and bandwidth restrict the number of transactions and data storage/ leading to network congestion and high fees. Flexibility and Innovation: Upgrading or customizing the platform can be difficult without affecting or depending on existing applications. Appchains differ from monolithic chains in several ways: On appchains/ one application uses all the blockspace but on monolithic chains/ there are multiple applications. Monolithic chains provide security for other applications/ while appchains leverage the security of a layer-0 chain. Appchains are flexible in terms of customization/ while monolithic chains have fixed and rigid parameters for their platform. AppChains vs Modular Chains Modular chains split their core functions into separate layers or components/ including consensus/ execution/ data availability and settlement. Examples of modular chains include Ethereum 2.0 and Solana. These chains offer several benefits: Scalability: Modular chains can process more transactions and store more data by using parallelization and specialization techniques. Resource Optimization: By outsourcing some tasks to other layers or chains/ modular chains can optimize their resources and bandwidth. However/ modular chains also face some drawbacks: Complexity: Modular chains depend on external parties or protocols to operate/ which increases network complexity. Security: The increased attack surface and reliance on external parties can present security concerns. Decentralization Trade-offs: Different layers or chains may have varying levels of trust and validation/ impacting overall decentralization. Appchains share some similarities with modular chains but also have key differences: Appchains still dedicate blockspace to a specific application/ while modular chains run multiple applications. Appchains connect to a general layer-0 solution/ whereas modular chains use specialized layer-1 or layer-2 solutions. AppChains vs Layer-2 Chains Layer-2 chains are scaling solutions that operate on top of a layer-1 blockchain/ handling some or all of the execution and settlement functions of a network. Examples of layer-2s include Optimism and Arbitrum. Layer-2 chains offer a number of advantages: Speed: Compression and aggregation techniques allow layer-2s to process more transactions and charge lower fees. Faster finality: Layer-2s can provide faster finality and confirmation times by using optimistic or zero-knowledge proofs. However/ layer-2s also come with some limitations: Dependency: Layer-2s rely on the layer-1 blockchain for consensus and data availability/ which can limit their autonomy and sovereignty. Security Risks: Layer-2s have the potential for fraud or censorship by malicious actors due to their dependence on the layer-1 blockchain. Appchains differ from layer-2s in several ways: Appchains handle all core functions on their own chain/ while layer-2s handle some or all of the execution and settlement functions on their platform. Appchains connect to a general layer-0 solution/ instead of operating on top of a specific layer-1 blockchain. AppChains vs Sidechains Sidechains are blockchains that are compatible with another blockchain. They handle all core functions on their own chain but do not use the security or scalability of the other blockchain. Examples of sidechains include Polygon. Sidechains offer several benefits: Performance: Sidechains can process more transactions and store more data by using their own resources and bandwidth. Flexibility: Sidechains can customize their parameters and features according to their needs and preferences. However/ sidechains also face some challenges: Security: Not relying on the security or scalability of the other blockchain exposes sidechains to more attacks and vulnerabilities. Interoperability: Sidechains may face difficulties in communicating and exchanging value with the other blockchain/ as they require bridges or adapters to enable cross-chain transactions. Appchains have some similarities and differences with sidechains: AppChains and sidechains both have their own native tokens and governance models and handle all core functions on their chains. AppChains leverage the security and scalability of a larger network/ while sidechains do not. AppChains connect to a general layer-0 solution/ while sidechains are compatible with a specific blockchain. Popular AppChains Many appchains are either live or in development/ but here are some of the most notable ones: Osmosis Osmosis is a decentralized exchange platform that allows users to create and trade custom liquidity pools across different zones in the Cosmos network. It is an appchain built on Cosmos using the Cosmos SDK and Tendermint. It has its own native token (OSMO) and governance model and leverages the security and interoperability of the Cosmos Hub. Osmosis offers users and developers a high-performance and customizable platform for automated market-making and liquidity provision. Litentry Litentry is a decentralized identity aggregator that enables users to link their identities across different blockchains and platforms. It is an appchain built on Polkadot using Substrate and parachains. Litentry has its own native token (LIT) and governance model/ and it leverages the security and interoperability of the Relay Chain. It offers users and developers a privacy-preserving and cross-chain platform for identity verification and reputation management. dYdX dYdX is a decentralized margin trading platform that allows users to trade perpetual contracts and spot markets with leverage. It is an appchain built on Ethereum using StarkWare's zero-knowledge rollup technology. It has its own native token (DYDX) and governance model and leverages the security and data availability of Ethereum. dYdX offers users and developers a fast and low-cost platform for advanced trading features and derivatives. Acala Acala is a decentralized finance hub that offers a multi-collateralized stablecoin/ a trustless staking derivative/ and a decentralized exchange platform. It is an appchain built on Polkadot using Substrate and parachains. It has its own native token (ACA) and governance model and leverages the security and interoperability of the Relay Chain. Acala offers users and developers a fast and low-cost platform for Web3 finance applications and assets. This article contains links to third-party websites or other content for information purposes only (“Third-Party Sites”). The Third-Party Sites are not under the control of CoinMarketCap/ and CoinMarketCap is not responsible for the content of any Third-Party Site/ including without limitation any link contained in a Third-Party Site/ or any changes or updates to a Third-Party Site. CoinMarketCap is providing these links to you only as a convenience/ and the inclusion of any link does not imply endorsement/ approval or recommendation by CoinMarketCap of the site or any association with its operators. This article is intended to be used and must be used for informational purposes only. It is important to do your own research and analysis before making any material decisions related to any of the products or services described. This article is not intended as/ and shall not be construed as/ financial advice. The views and opinions expressed in this article are the author’s [company’s] own and do not necessarily reflect those of CoinMarketCap. CoinMarketCap is not responsible for the success or authenticity of any project/ we aim to act as a neutral informational resource for end-users.","date":"2023-04-19T10:29:30.009Z","tags":"","author":"Ivan Cryptoslav","category":"Crypto Basics","id":2000016}
,{"link":"https://coinmarketcap.com/academy/article/how-to-participate-in-the-crypto-market-with-no-money","websiteSource":"CoinMarketCap","type":"article","summary":"Broke, bored and curious about crypto? Look no further! Here is a guide on how to participate in the crypto market with no money!","title":"How To Participate in the Crypto Market With No Money in 2023 | CoinMarketCap","detailedContent":"Cryptocurrencies are one of the most profitable asset class of the last decade/ with major digital assets like Bitcoin (BTC)/ Ethereum (ETH) and BNB providing early investors with staggering returns. They’re also notoriously volatile. The average cryptocurrency can see its value fluctuate more in a day than traditional equities do in a year. In light of this/ not everyone has the financial flexibility or risk tolerance necessary to safely invest money into cryptocurrencies. Fortunately/ there are more than a handful of ways to earn and profit from cryptocurrencies with little to no investment required (not financial advice). Let’s have a look at some of the popular methods! Subscribe Join us in showcasing the cryptocurrency revolution/ one newsletter at a time. Subscribe now to get daily news and market updates right to your inbox/ along with our millions of other subscribers (that’s right/ millions love us!) — what are you waiting for? Airdrop Airdrops are by far the most popular way to gain exposure to cryptocurrencies without any investment. As the name suggests/ these are free token distribution programs designed to reward early participation in an ecosystem/ diversify and increase the number of token holders/ and increase the amount of buzz surrounding the project. Though chances of airdrops could be highly speculative/ the barrier to entry is usually extremely low/ and the number of different airdrops available is high. Because of this/ the total value you can earn from airdrop can be significant. Moreover/ several airdrops have provided lucrative returns to investors. These include: Aptos: This layer-1 blockchain airdropped APT tokens to participants in its incentivized testnet or APTOS:ZERO Testnet NFT minters. Some users received over $1/000 in APT. Uniswap: Anybody who had used Uniswap before the airdrop snapshot date was eligible to claim 400 UNI tokens after its token generation event. At its peak/ these were worth over $17/600. Arbitrum: One of the more recent airdrops/ early users of the Arbitrum ecosystem received a variable amount of ARB tokens. Some addresses received up to 10/250 ARB/ worth over $100/000 at its peak. Decred: Regarded as one of the most profitable airdrops of all time. At its peak/ each airdrop participant received over $60/000 worth of DCR tokens. In most cases/ airdrops can be earned or claimed free of charge. But in some cases/ it can be more challenging to meet the airdrop eligibility requirements. For example/ many of the more profitable airdrops require you to be an early participant in the surrounding ecosystem — e.g. by providing liquidity/ conducting transactions/ and interacting with DApps. These aren’t a direct cost if they’re part-and-parcel of your regular activity/ but in many cases/ users will increase their activity just to maximize their rewards. Keep track of the latest exclusive airdrops here. Learn and Earn Initiatives The cryptocurrency industry is vast and still remains poorly understood by the masses. To help tackle this/ a number of projects and platforms have launched some form of a ‘learn and earn’ initiative — which sees users earn rewards in the form of cryptocurrencies for brushing up on their general crypto knowledge or learning about a specific product or project. Here at CoinMarketCap/ we have our very own CMC Earn platform. This allows users to earn crypto rewards for watching videos and testing their knowledge about new and established crypto projects. This provides an excellent way to get to grips with cryptocurrencies while providing rewards that may multiply in value over time. A range of other platforms also offers similar opportunities. These include: Coinbase Learning Rewards: Allows users to earn a small amount of different cryptocurrencies (generally ~$3 to ~$15 worth) for taking a short course about the project. This can then be directly traded in the user's Coinbase account. Binance Academy Learn and Earn: Allows users to earn cryptocurrency rewards by improving their blockchain knowledge and participating in simple tasks. BitDegree Learn Drops: By partnering with dozens of Web3 projects/ BitDegree allows users to earn various learn drop rewards by watching educational content and answering quizzes. In most cases/ learn-and-earn programs will only provide a small reward — usually in the order of a few dollars. But over time/ the rewards can stack up. Work in Crypto Simply working in the cryptocurrency industry is arguably the best way to get your hands on cryptocurrencies without investing your money. This is because many Web3 native firms will allow employees or freelancers to receive their salary in crypto. View post on Twitter Depending on the firm/ this might be a specific crypto of your choice/ or one of a range of options — such as BTC/ ETH/ or stablecoins. In some cases/ these cryptocurrencies can go on to accrue value/ providing the holder with potentially significant profit. That said/ they can also fall in value — cutting into your earnings. Fortunately/ the Web3 and cryptocurrency space is always brimming with opportunities/ and there are numerous roles available to choose from — many of which pay well. For a complete look at currently open opportunities in the Web3 space/ see the CoinMarketCap Jobs Board. Run a Node Today/ a large number of cryptocurrency projects operate a permissionless consensus system that allows practically anybody with the requisite hardware to participate in the process of validating transactions or performing other crucial blockchain functions. These network participants are known as node holders and are tasked with running special blockchain client software that allows them to interact with the rest of the network and perform specialized functions. Depending on the platform/ these node holders can have different roles. For example/ POS network node holders are typically involved in block production and transaction confirmation. Whereas node holders in decentralized storage networks might be involved in storing file fragments/ ensuring redundancy/ or providing bandwidth. These networks generally provide users with token rewards/ usually derived from the token emission or a fraction of the fees generated by the network. Some will require you to stake a certain number of the network’s native tokens to begin running a node/ while others have no staking requirement. These include Nano/ Stellar/ and the Bitcoin Lightning Network. However/ node holders will usually need to meet specific hardware and performance requirements. This might include meeting minimum CPU/ hard drive/ and memory requirements/ in addition to bandwidth and uptime standards. The amount you can earn will vary based on the activity of the network and your relative share of its resources/ as well as the value of the reward token. That said/ rewards can be worth the effort — particularly if you already have the hardware available. Join a Testnet Participating in the testnet of new blockchains can be a great way to earn free cryptocurrency with little to no investment required. A testnet is a version of a blockchain that is created specifically for testing purposes. It is a network where developers can experiment with new features/ test the functionality of the network/ and identify and fix any potential bugs or vulnerabilities before deploying its mainnet. To participate in a testnet/ users typically need to download a wallet or client that is specifically designed for the testnet — in many cases/ it simply involves adding the testnet RPC to their pre-existing Web3 wallet. Once they have the wallet set up/ they can then start mining or staking on the network/ or begin interacting with DApps — such as providing liquidity/ minting NFTs/ borrowing/lending funds and more. Many new blockchain projects offer incentives for users to participate in their testnets. These incentives can include free tokens or coins that can be used on the mainnet once it launches/ as well as other rewards such as discounts on future services or products. Recently/ several major blockchains have provided handsome rewards to early testnet participants — including Oasis/ Aptos and Dusk Network. To find out about upcoming testnet opportunities/ users can follow blockchain projects on social media/ join their communities on forums and chat groups/ and stay up to date with industry news and announcements. Note: Some projects hold a clearly defined incentivized testnet program/ whereas others opt to reward testnet participants retroactively. The latter tends to be more profitable since there are fewer participants. Participate in a Free Mint Non-fungible tokens (NFTs) have garnered a significant amount of attention in recent years due to both their potential and in many cases/ their desirability. Popular NFT collections like Bored Ape Yacht Club (BAYC)/ Cryptopunks/ Doodles and Moonbirds have gained significant value since their launch — generating substantial returns for those who purchased one during their initial mint. But while most NFT collections require users to buy their NFTs/ some prominent collections came about by way of a “free mint”. As the name suggests/ this means lucky users were able to get their hands on an NFT for free (barring gas fees). NFT free mints are usually conducted on a first-come-first-served basis/ but some projects opt for a lottery system to determine who can get their hands on a free NFT. Besides free mints/ many NFT projects will give away NFTs to users via competitions or various other initiatives. These are usually advertised on the official project Twitter or community channel. Join a Bug Bounty If you’ve got technical chops or a good amount of free time/ bug bounties can be an excellent way to get your hands on free crypto. Bug bounties come in various shapes in sizes/ but generally involve rewarding users for finding flaws/ vulnerabilities or loopholes in the way a blockchain project or smart contract operates. In return for securely and privately disclosing the issue/ users earn a reward. The size of the reward is generally related to the nature of the vulnerability/ including its severity/ risk level/ and novelty. In the vast majority of cases/ users will need technical knowledge to participate in a bug bounty. This will usually include an excellent understanding of blockchain technology/ programming experience/ and knowledge of a variety of common security vulnerabilities — such as buffer overflow attacks and cross-site scripting (XSS). View post on Twitter In some cases/ the reward for finding a reporting a critical bug can count in the millions of dollars. Some bug bounties might also support non-technical users/ such as those that offer rewards for uncovering or intercepting social engineering attacks/ for promoting the project or assisting it in some other way/ or for offering feedback on the user experience. Platforms like HackenProof/ Immunefi and Bugcrowd can be used to search the range of available bug bounties/ while many individual projects will advertise their bug bounties on their website or socials. Referral Programs Referral programs are an incentivized marketing strategy that encourages existing users to invite their friends and family to join a particular cryptocurrency platform. In return/ both the referrer and the referred user can earn rewards in the form of free cryptocurrencies or other benefits. To participate in a referral program/ users first need to sign up for the cryptocurrency platform they wish to refer their friends to. After creating an account/ they can then access or generate their unique referral link or code that they can share with their friends and family. Some referral programs offer profit-sharing opportunities/ such that the referee earns a fraction of the revenue their referrals bring to the platform. Cryptocurrency exchanges and casinos typically operate using this system/ whereas other platforms — typically cryptocurrency savings and hardware manufacturer platforms — will typically offer a one-off referral fee. Today/ practically every major centralized cryptocurrency exchange offers a referral scheme. Some of the best-known currently include: Binance: The Binance Standard Referral program allows users to earn up to 40% commission on the trading fees generated by their referrals. Coinbase: Coinbase has a very simple affiliate program that allows users to refer their friends/ with both the referrer and the referee earning a $10 reward. ByBit: ByBit's referral program allows users to earn up to 30% of the trading fees generated by qualified referees. There is no limit to how long the commission will be earned. With that in mind/ it’s important to check the terms and conditions associated with referral campaigns/ as they can limit who is eligible and how rewards are paid. This article contains links to third-party websites or other content for information purposes only (“Third-Party Sites”). The Third-Party Sites are not under the control of CoinMarketCap/ and CoinMarketCap is not responsible for the content of any Third-Party Site/ including without limitation any link contained in a Third-Party Site/ or any changes or updates to a Third-Party Site. CoinMarketCap is providing these links to you only as a convenience/ and the inclusion of any link does not imply endorsement/ approval or recommendation by CoinMarketCap of the site or any association with its operators. This article is intended to be used and must be used for informational purposes only. It is important to do your own research and analysis before making any material decisions related to any of the products or services described. This article is not intended as/ and shall not be construed as/ financial advice. The views and opinions expressed in this article are the author’s [company’s] own and do not necessarily reflect those of CoinMarketCap. CoinMarketCap is not responsible for the success or authenticity of any project/ we aim to act as a neutral informational resource for end-users.","date":"2023-04-19T03:57:15.504Z","tags":"","author":"Daniel Phillips","category":"How-to Guides","id":2000017}
,{"link":"https://coinmarketcap.com/academy/article/optimistic-rollups-vs-zk-rollups-the-ultimate-comparison","websiteSource":"CoinMarketCap","type":"article","summary":"Optimistic rollups vs ZK-rollups: which one will prove to be a better solution to Ethereum's scalability issues?","title":"Optimistic Rollups vs ZK-Rollups: The Ultimate Comparison | CoinMarketCap","detailedContent":"One of the biggest challenges facing Ethereum today is scalability. More users and applications are flocking to the network/ leading to congestion and high fees. Optimistic rollups and ZK rollups are some of the most promising ways to increase throughput and lower costs. This article will compare optimistic rollups vs ZK rollups while covering: What rollups are How optimistic rollups work How ZK-rollups work The benefits and drawbacks of optimistic rollups and ZK-rollups A comparison of optimistic rollups vs ZK-rollups Applications of optimistic and ZK-rollups Subscribe Join us in showcasing the cryptocurrency revolution/ one newsletter at a time. Subscribe now to get daily news and market updates right to your inbox/ along with our millions of other subscribers (that’s right/ millions love us!) — what are you waiting for? What Are Rollups? Rollups are layer-two scaling solutions that move transactions off-chain and maintain the mainnet's security and decentralization. The name rollup comes from the fact that transactions are grouped together into batches (or rolls) and then posted on Ethereum's mainchain for finality. The main benefit of rollups is that they can significantly reduce gas fees and increase transaction speed while preserving smart contract compatibility and composability. This means that users and developers can enjoy a better user experience and more innovation on Ethereum without compromising its core values. The main challenge of rollups is that different rollups require different ways of verifying transactions off-chain and handling disputes on-chain. Not all rollups are created equal. The two main types are optimistic rollups and ZK-rollups. They differ in their transaction verification and dispute handling and come with different benefits and drawbacks. What Are Optimistic Rollups? Optimistic rollups derive their name from an optimistic assumption: transactions are valid by default unless proven otherwise. The three main components of optimistic rollups are the smart contract/ the sequencer/ and the validators. The smart contract acts as the bridge between the Ethereum mainnet and the second layer. It receives transaction data from the sequencer as calldata/ which is stored for future verification on the blockchain. Transactions are executed off-chain by a centralized entity called a sequencer. The sequencer publishes the data on Ethereum's main chain as calldata. The transactions don't require any proof of validity or correctness. A promise that they will be available for verification if needed is enough. The validator network monitors the sequencer's activity and checks if any transaction violates the rules of Ethereum. This verification process can uncover invalid transactions/ which can be challenged by submitting a fraud proof on-chain to challenge it. It contains evidence showing how and why the transaction is invalid. If the challenge is successful/ the invalid transaction is reverted/ and the sequencer is penalized. What Are ZK-Rollups? ZK-Rollups rely on a cryptographic technique called zero-knowledge proofs: transactions are valid by default if proven to be so. They are executed off-chain by a network of nodes generating transaction data and proofs of validity. These are then submitted to the Ethereum mainnet as calldata. ZK-rollups have three main components: transactions/ state commitments/ and zero-knowledge validity proofs. Users sign transactions/ which sends them to layer-two producing blocks and batches. State commitments are snapshots of the current state of the second-layer blockchain. They are hashed and stored on the mainnet as calldata. Zero-knowledge validity proofs are cryptographic proofs guaranteeing the transactions in a batch are valid and follow Ethereum’s rules and do not mess with the state of the blockchain. Users sign transactions and send them to the operator. The operator executes transactions on the L2 according to Ethereum’s rules and updates the state accordingly. It then generates a state commitment for each block and a zero-knowledge proof for each batch of blocks. The data is submitted to Ethereum as calldata and its validity can be verified by anyone using the proofs and state commitments without running any computation or state transition. Advantages And Disadvantages of Optimistic Rollups The main advantage of optimistic rollups is the high potential throughput and low latency. Transactions are executed almost instantly off-chain and don't have to wait for on-chain confirmation. They also preserve smart contract compatibility and composability with Ethereum since they use the same virtual machine (EVM) and state transition rules. The main disadvantage of optimistic rollups is the long withdrawal period/ which is required for users to exit the system safely. Users need to wait for a sufficient amount of time to ensure that no fraud proofs are submitted against their transactions. Otherwise/ their funds could be at risk if an invalid transaction affects their balance. This waiting period can be more than one week but can be circumvented by using specialized bridges/ which allow faster withdrawals. Advantages and Disadvantages of ZK-Rollups The main advantage of ZK-rollups is also high potential throughput and low latency. Just like with optimistic rollups/ transactions are executed off-chain and ultimately secured by the L1. The main disadvantage of ZK-rollups is the complex cryptography and engineering structure of the rollups themselves. Consequently/ they are more expensive and harder to implement than optimistic rollups. They also may not support all types of smart contracts or functionalities that Ethereum offers. Optimistic Rollups vs ZK-Rollups Here is a quick overview table comparing optimistic and ZK-rollups according to different attributes: Optimistic vs ZK-rollups: Scalability and Costs One of the main goals of rollup solutions is to increase the throughput of transactions on Ethereum and reduce the gas fees for users. Optimistic rollups and ZK-rollups achieve this goal by batching transactions and periodically submitting them to the mainnet. However/ they have different trade-offs in terms of scalability and costs. Optimistic rollups can handle more transactions per second than ZK-rollups. On the other hand/ they require more gas to submit their batches to the main chain. Zk-rollups can save more gas than optimistic rollups/ but they also have higher computational costs to generate their zero-knowledge proofs. Additionally/ optimistic rollups have lower entry barriers for developers and users than ZK-rollups. They support any Ethereum smart contract without modification and do not require special hardware or software. ZK-rollups/ on the other hand/ require developers to rewrite their smart contracts in a specific language and users to install a compatible wallet or browser extension. Optimistic vs ZK-rollups: Security Another important factor to consider when comparing rollup solutions is their security and how they protect users’ funds and data from malicious actors. Optimistic rollups and ZK-rollups have different security risks and assumptions. Optimistic rollups are vulnerable to censorship attacks/ where a malicious sequencer or validator can delay or prevent valid transactions from being submitted to the main chain. They also rely on users and validators to monitor the side chain and challenge any fraudulent transactions within a certain time window. If no one challenges a fraudulent transaction/ it can be finalized on the main chain and cause users to lose their funds. ZK-rollups are immune to censorship attacks/ as they do not require anyone to submit or verify transactions on the side chain. They also do not rely on users or validators to challenge fraudulent transactions thanks to the ZK-proofs guaranteeing their validity before they are accepted by the main chain. However/ ZK-rollups have a trusted setup assumption/ where a group of participants must generate and destroy some secret parameters used to create the zero-knowledge proofs. If these parameters are compromised or leaked/ they can be used to create fake proofs and steal users’ funds. Optimistic vs ZK-rollups: Latency Latency refers to the time it takes for a transaction to be confirmed and finalized on the main chain. Optimistic rollups and ZK-rollups have different latency characteristics depending on their verification methods. Optimistic rollups have low latency for users/ as they can receive instant confirmation from the L2 without waiting for the main chain. However/ they also have high latency for finality/ as they have to wait for a challenge period to expire before their transactions are finalized on the main chain. This challenge period can vary from minutes to hours depending on the network congestion and security parameters. ZK-rollups have high latency for users/ as they have to wait for the zero-knowledge proofs to be generated and verified by the side chain before receiving confirmation. However/ they also have low latency for finality/ as they do not have a challenge period and their transactions are finalized on the main chain as soon as they are submitted. This can take from seconds to minutes depending on the block time and gas price. Optimistic vs ZK-rollups: Privacy Privacy refers to the ability of users to conceal their identities and transaction details from third parties. The different verification methods of optimistic rollups and ZK-rollups mean they have different privacy features. Optimistic rollups have low privacy for users/ as they have to reveal their transactions and signatures on the side chain and the main chain. Anyone can observe and analyze these transactions and link them to users’ addresses and identities. ZK-rollups have high privacy for users/ as they use zero-knowledge proofs to hide their transactions and signatures on the side chain and the main chain. Only the sender and receiver of a transaction can know its details and no one can link it to users’ addresses or identities. However/ ZK-rollups also have some privacy limitations/ such as requiring users to register their public keys on the sidechain before sending or receiving transactions. This can expose some information about users’ activity patterns and balances. Optimistic vs ZK-rollups: Validity Proof Validity proofs prove that a batch of transactions on the L2 is correct and consistent with the L1. Optimistic rollups use fraud proofs as their validity proof. They assume the transactions are correct by default and only verify them if someone challenges them. This not only allows them to publish blocks frequently and cheaply but also introduces a risk of invalid transactions being accepted if no one challenges them. ZK-rollups use zero-knowledge proofs as their validity proof. They do not assume anything about the transactions and verify them using cryptographic evidence. Every transaction is valid and final/ however/ this approach requires more computation and time to generate the proofs. Both validity-proof types have advantages and disadvantages in terms of scalability and security. The choice between them depends on the specific requirements and trade-offs of each application. Fraud proofs are faster and more flexible/ but also more vulnerable to attacks or errors. Zero-knowledge proofs are more secure and efficient/ but also more complex and limited. Optimistic vs ZK-rollups: Readiness for DeFi Optimistic and ZK-rollups differ in how well they adapt to the functionality required for DeFi. Optimistic rollups have a similar execution model to the Ethereum Virtual Machine (EVM)/ allowing them to run most of the existing smart contracts and protocols with minimal changes. Moreover/ several projects already use optimistic rollups. The Optimism ecosystem is home to Uniswap/ Synthetix/ Sushiswap and many other DeFi protocols. ZK-rollups are less compatible with the EVM/ limiting their functionality and expressiveness. They also have fewer projects using them/ although some are emerging/ such as ZigZag Exchange/ Loopring and zkSync. Both solutions are growing in their support for DeFi applications. Optimistic rollups are focusing on improving their security and efficiency/ while ZK-rollups work on enhancing their EVM compatibility and usability. In the long run/ both of them will likely be popular in the DeFi space. Optimistic vs ZK-rollups: Programming Easiness Programming easiness is a measure of how simple and convenient it is to develop and deploy applications on a scaling solution. Optimistic and ZK-rollups differ in how simple and convenient it is to develop and deploy applications for their respective ecosystems. Optimistic rollups are fully compatible with the Ethereum Virtual Machine (EVM)/ meaning developers can use the same languages/ frameworks/ and tools they use on Ethereum. Thanks to fraud proofs/ no special knowledge or skills are needed to program on them. ZK-rollups are not fully compatible with the EVM/ so developers have to adapt their code and use different languages/ frameworks/ and tools specific to ZK-rollups. That requires more advanced knowledge and skills. Popular Optimistic Rollup And ZK-Rollup Projects Some popular optimistic rollup projects include: Optimism: Read the Ultimate Guide to the Optimism Ecosystem. Arbitrum: Read the Ultimate Guide to the Arbitrum Ecosystem. Popular ZK-rollup projects include: Starkware: Read the Ultimate Guide to the Starkware/ StarkNet and StarkEx Ecosystem. This article contains links to third-party websites or other content for information purposes only (“Third-Party Sites”). The Third-Party Sites are not under the control of CoinMarketCap/ and CoinMarketCap is not responsible for the content of any Third-Party Site/ including without limitation any link contained in a Third-Party Site/ or any changes or updates to a Third-Party Site. CoinMarketCap is providing these links to you only as a convenience/ and the inclusion of any link does not imply endorsement/ approval or recommendation by CoinMarketCap of the site or any association with its operators. This article is intended to be used and must be used for informational purposes only. It is important to do your own research and analysis before making any material decisions related to any of the products or services described. This article is not intended as/ and shall not be construed as/ financial advice. The views and opinions expressed in this article are the author’s [company’s] own and do not necessarily reflect those of CoinMarketCap. CoinMarketCap is not responsible for the success or authenticity of any project/ we aim to act as a neutral informational resource for end-users.","date":"2023-04-03T07:40:56.319Z","tags":"","author":"Ivan Cryptoslav","category":"Crypto Basics","id":2000018}
]