{
  "link": "https://cryptoslate.com/taiwan-revises-money-laundering-act-to-include-digital-assets/",
  "websiteSource": "CryptoSlate",
  "type": "article",
  "summary": "",
  "title": "Taiwan revises money laundering act to include digital assets",
  "detailedContent": "Taiwan is bolstering its anti-money laundering regulations through amendments to its Money Laundering Control Act, as the island aligns its laws with international standards set by the Asia/Pacific Group on Money Laundering (APG). The key focus of the amendments is to bring virtual assets and virtual asset service providers firmly under the oversight of Taiwan’s anti-money laundering regime. The revised law adds clear definitions for “virtual assets” and “virtual asset service providers” to close previous gaps. Virtual asset service providers must now register with the authorities for anti-money laundering purposes and demonstrate their service capabilities. Failure to comply will result in criminal penalties. Maximum fines for designated non-financial businesses or personnel that violate the regulations are also being raised, with the ability to impose penalties per violation. To combat cross-border money laundering, the amendments require passengers entering or leaving Taiwan to declare any foreign currencies, Hong Kong or Macau-issued currencies, New Taiwan Dollars, securities, gold, or other items above a certain amount. Customs will have the power to seize any undeclared amounts exceeding the specified limit. To encourage self-policing, the revised law increases fines on corporations involved in money laundering while also providing exemptions from liability if the company had taken preventive measures. Sentence reductions are also possible for individuals who surrender illicit gains and assist in investigations. The strengthening of Taiwan’s anti-money laundering laws comes as the island seeks to address gaps identified by the APG in previous evaluations. By extending oversight to the digital assets sector and encouraging better corporate governance, Taiwan aims to make its financial system more resilient to money laundering threats as it further integrates with the global economy.",
  "date": "",
  "tags": "",
  "author": "Liam \u0027Akiba\u0027 Wright",
  "category": "Taiwan, Featured, Regulation"
}
,{
  "link": "https://cryptoslate.com/binance-accused-of-firing-whistleblower-for-internal-market-manipulation-report/",
  "websiteSource": "CryptoSlate",
  "type": "article",
  "summary": "",
  "title": "Binance accused of firing whistleblower for internal market manipulation report",
  "detailedContent": "The Wall Street Journal published an exclusive report on May 9 alleging that Binance, the world’s largest crypto exchange, fired the head of its market surveillance team after he raised concerns about potential market manipulation by a high-profile client. According to former Binance insiders interviewed by the Journal, the surveillance team had detected suspicious trading activity by DWF Labs, a firm run by a “Lamborghini-loving crypto trader” that had rapidly become one of Binance’s top clients. The team’s investigation concluded that DWF had engaged in pump-and-dump schemes and wash trading on Binance, violating the exchange’s terms of use. However, when the surveillance team reportedly submitted a report recommending DWF’s removal from the platform, Binance leadership rejected the findings and fired the team’s head, the Journal reports. Several other investigators were subsequently laid off or quit voluntarily. In response to the Journal’s reporting, Binance issued a statement on X affirming its “strict market surveillance program” and stating it does not tolerate market abuse. The exchange said that over the last three years, it has offboarded nearly 355,000 users with a transaction volume of more than $2.5 trillion for violating its terms of use. Binance added that “market maker competition is fierce,” its investigation team’s job is to be “neutral and look at the evidence without any bias, including bias that might come from market-making firms’ claims against their competitors.”The company said it aims to ensure healthy competition and protect users from manipulation. DWF Labs also responded to what it called “unfounded” allegations that “distort the facts.”The firm stated it “operates with the highest standards of integrity, transparency, and ethics” and remains committed to supporting its over 700 partners across the crypto ecosystem. The allegations come as Binance faces increasing regulatory scrutiny. In 2023, the exchange pleaded guilty to violating US anti-money laundering requirements and agreed to pay $4.3 billion in fines. Founder Changpeng Zhao also stepped down as CEO and was sentenced to four months in jail. The Securities and Exchange Commission also filed civil charges accusing Binance of misleading US investors about its risk controls and trading practices. Earlier reporting by the Journal tied Zhao to two trading firms that operated on Binance’s US arm and raised concerns about their activity’s independence and compliance oversight. The dismissal of the whistleblower and his team raises further questions about Binance’s commitment to preventing market abuse and manipulation on its platform. While the exchange maintains it does not favor any users and prioritizes platform safety, the Journal’s reporting suggests it has, at times, put the interests of profitable clients ahead of market integrity concerns raised by its own investigators.",
  "date": "",
  "tags": "",
  "author": "Liam \u0027Akiba\u0027 Wright",
  "category": "Binance, US, Exchanges"
}
,{
  "link": "https://cryptoslate.com/us-sec-delays-crypto-wallet-provider-exodus-nyse-american-listing-amid-ongoing-scrutiny/",
  "websiteSource": "CryptoSlate",
  "type": "article",
  "summary": "",
  "title": "SEC delays crypto wallet provider Exodus\u0027 NYSE American listing amid ongoing scrutiny",
  "detailedContent": "Crypto wallet provider Exodus said the US Securities and Exchange Commission (SEC) made a “surprising last-minute decision” that delayed its planned listing on the NYSE American Stock Exchange, according to a May 9 statement. NYSE said the SEC halted the listing because the financial regulator’s staff are still reviewing Exodus’s registration statement. Exodus added: Earlier in the week, Exodus revealed that its shares would be uplisted from the OTCQX to NYSE American by May 9. At the time, CEO JP Richardson said the move would “create greater long-term value for our stockholders by increasing our presence within the investor community and, in turn, increase liquidity.” However, with the SEC’s delaying the uplisting, Exodus said it might reconsider listing on a national securities exchange later. Nonetheless, its shares, with the ticker EXOD, would continue to trade on OTCQX. Richardson said: Meanwhile, recent unaudited reports on Exodus’ first-quarter earnings revealed a substantial 118% year-on-year revenue growth, totaling around $29.1 million. The firm said it has approximately 1.69 million active users. In recent years, the SEC, under Gary Gensler‘s leadership, has taken an aggressive stance toward the emerging crypto industry. Gensler’s tenure has been marked by a focus on integrating crypto into the SEC’s regulatory framework, using the Howey test to classify digital assets as securities. However, critics argue against the SEC’s heavy-handed enforcement tactics, urging Congress to provide clear legislative guidance instead. Unfortunately, the pace of legislative action in this realm has been slow, exacerbating the industry’s uncertainty.",
  "date": "2024-05-09T08:49:44+00:00",
  "tags": "",
  "author": "Oluwapelumi Adejumo",
  "category": "US, Featured, Legal, Regulation"
}
,{
  "link": "https://cryptoslate.com/core-scientific-reports-210-7-million-in-q1-net-income-2825-btc-production/",
  "websiteSource": "CryptoSlate",
  "type": "article",
  "summary": "",
  "title": "Core Scientific reports $210.7 million in Q1 net income, 2,825 BTC production",
  "detailedContent": "Core Scientific reported a $210.7 million net income for the first quarter on May 8. The change represents an increase of $211.1 million from the first quarter of 2023, when the company reported a net loss of $0.4 million. The company also reported $179.3 million in first-quarter revenue, including $150 million from crypto mining and $29.3 million from hosting. The change in total revenue marks an increase of $58.6 million compared to the first quarter of 2023 when the company reported revenue of $120.6 million. Core Scientific reported $98.1 million in cash and cash equivalents on its balance sheet, up from $50.4 million in the fourth quarter of 2023. Core Scientific also reported significant Bitcoin production. The firm earned 2,825 BTC through self-mining — more than any publicly traded Bitcoin mining firm in North America. The company’s first-quarter BTC is worth $172.5 million at current prices. The firm reported a hash rate of 25.5 exahashes per second (EH/s). The total hash rate includes 19.3 EH/s for self-mining, through which the company produces its own Bitcoin, plus 6.2 EH/s for hosting, through which it produces Bitcoin for its customers. Core Scientific owned and managed about 745 megawatts of infrastructure, which it claims is greater than any other publicly traded Bitcoin miner in North America. Core Scientific is also exploring alternative revenue streams. CEO Adam Sullivan said the firm is discussing with customers the conversion of over 500 megawatts to high-performance computing. By combining computing and Bitcoin mining, the firm will be active in “two very attractive markets,” Sullivan said. A separate Financial Post report indicates that the company plans for its high-performance computing business to cater to artificial intelligence (AI) firms. The conversion of the 500 megawatts of infrastructure could take three to four years, but the company will generate revenue as it brings on clients.",
  "date": "",
  "tags": "",
  "author": "Mike Dalton",
  "category": "Bitcoin, US, Earnings, Mining"
}
,{
  "link": "https://cryptoslate.com/nigeria-claims-binances-bribery-allegations-are-blackmail/",
  "websiteSource": "CryptoSlate",
  "type": "article",
  "summary": "",
  "title": "Nigeria claims Binance\u0027s bribery allegations are \u0027blackmail\u0027",
  "detailedContent": "The Nigerian government has refuted bribery allegations made by crypto exchange Binance, which were described as baseless and an attempt to distract from the company’s legal challenges in the country, according to a press statement released on May 8. Binance CEO Richard Teng recently alleged that Nigerian officials demanded $150 million in crypto to settle an ongoing criminal investigation against the company. However, Rabiu Ibrahim, Special Assistant to the Minister of Information and National Orientation, dismissed the allegations as “diversionary tactics” and “blackmail.” The Nigerian government said Binance is being probed for serious offenses, including money laundering, terrorism financing, and manipulating foreign exchange through illegal trading. It further highlighted that another Binance executive escaped custody and is now considered a fugitive with an international arrest warrant issued by Interpol. The government reiterated its commitment to following lawful processes and urged Binance to respect judicial proceedings rather than engaging in public relations maneuvers. The statement concluded by emphasizing that the Nigerian government will not succumb to any form of blackmail from any entity, whether local or foreign. Amid the bribery allegations, Teng has also called attention to the detention of Tigran Gambaryan, a US citizen and Binance’s head of financial crime compliance, who was apprehended upon his arrival in Abuja on Feb. 26. Teng condemned Gambaryan’s detention as a tactic to control Binance, stating that the executive was in Nigeria as a “functional expert” rather than a negotiator or decision-maker. This controversy arises as Nigeria intensifies its regulatory measures against crypto trading to protect its currency, the Naira, from manipulation. Over recent months, the Nigerian government has directed telecommunications providers to restrict local crypto users’ access to trading platforms such as Binance and OctaFX. Additionally, authorities have accused the crypto exchange Binance of enabling trades worth billions, further exacerbating the strain on the Naira. The Nigerian Securities and Exchange Commission also recently announced plans to remove the Naira from peer-to-peer trading platforms as part of a broader crackdown on crypto trading, which has been blamed for adding volatility to the foreign exchange market.",
  "date": "2024-05-10T00:50:35+00:00",
  "tags": "",
  "author": "Assad Jafri",
  "category": "Binance, Nigeria, Exchanges, Legal"
}
,{
  "link": "https://cryptoslate.com/biden-administration-to-veto-overturning-of-sec-crypto-rule-sab-121/",
  "websiteSource": "CryptoSlate",
  "type": "article",
  "summary": "",
  "title": "Biden administration to veto overturning of controversial SEC crypto rules",
  "detailedContent": "The Biden administration said on May 8 that it would veto H.J. Res. 109, which intends to overturn the SEC’s Staff Accounting Bulletin 121 (SAB 121). The administration said it “strongly opposes” the resolution as the change will interfere with the SEC’s efforts to protect crypto market investors and safeguard the financial system. The administration added that the SEC released the bulletin due to demonstrated risks that have caused customer losses, and it reflects “considered SEC staff views.” The Biden administration said that lawmakers’ invocation of the Congressional Review Act would inappropriately control the SEC’s ability to create guardrails and address crypto issues. Such limits would introduce financial instability and market uncertainty. The notice concluded: The US House of Representatives is scheduled to vote on the resolution on May 8. Chairman of the House Financial Services Committee Patrick McHenry delivered statements supporting the resolution, calling SAB 121 “one of the most glaring examples” of SEC overreach under its current chair, Gary Gensler. He asserted the agency avoided public comment and the rulemaking process as required by the Administrative Procedure Act (APA) by labeling the requirements for staff guidance. McHenry called SAB 121 “cost-prohibitive” to banks that aim to provide custody for customer crypto and warned that reducing bank participation could leave user assets vulnerable. Representative Tom Emmer has also supported the overturning of SAB 121. Congressman Mike Flood initially sponsored the resolution. SAB 121 requires financial institutions and firms that safeguard customer crypto to hold the assets on their balance sheet. SAB 121 has also received pushback from within the banking industry itself. The American Bankers Association (ABA) said in February that the policy has posed challenges since its introduction in 2022. ABA noted two main problems — SAB 121 makes it “practically impossible” for banks to act as custodians for spot Bitcoin ETFs due to reserve and capital requirements, and the bulletin fails to distinguish between cryptos on public ledgers and traditional assets on permissioned ledgers. Despite its dissatisfaction with the current rules, the ABA has asked the SEC to modify SAB 121 rather than overturn it entirely.",
  "date": "2024-05-08T20:05:20+00:00",
  "tags": "",
  "author": "Mike Dalton",
  "category": "US, Featured, Regulation"
}
,{
  "link": "https://cryptoslate.com/trumps-potential-return-could-catalyze-major-uptick-in-alt-investments-like-bitcoin-stanchart/",
  "websiteSource": "CryptoSlate",
  "type": "article",
  "summary": "",
  "title": "Trump\u0027s potential return could catalyze major uptick in alt investments like Bitcoin – StanChart",
  "detailedContent": "A recent Standard Chartered report forecasts that a second term for Donald Trump could significantly boost Bitcoin and other digital assets as viable alternative investments. The report investigates how US fiscal policies under a potential Trump administration could steer investors toward Bitcoin and other cryptocurrencies. Meanwhile, the lender has also revised its outlook on Bitcoin’s price performance in the coming months and believes the flagship crypto saw its local bottom on May 1. StanChart analyst Geoffrey Kendrick told CryptoSlate: Kendrick added that the outlook revision was driven by a “less hawkish than feared FOMC and a friendly US jobs report,” — which have been enough to boost inflows into spot Bitcoin ETFs following a record week of outflows. Standard Chartered reaffirmed its predicted target of $150,000 per Bitcoin by the end of 2024, escalating to $200,000 by the end of 2025. The bullish targets hinge on various factors, including global fiscal conditions, the US electoral outcomes, and the evolving regulatory landscape affecting digital currencies. According to the StanChart report, Trump’s anticipated presidency would likely promote a regulatory environment conducive to digital assets. The report points to potential legislative changes, such as the approval of US spot exchange-traded funds (ETFs) for cryptocurrencies, marking a notable departure from current regulatory approaches. These moves would increase accessibility and legitimacy for Bitcoin and similar assets, potentially attracting a broader base of institutional and retail investors. Highlighting fiscal patterns from Trump’s previous term, the report noted that foreign official US Treasury (UST) buyers significantly scaled back their holdings, with net selling averaging $207 billion annually. In comparison, during Biden’s term, this figure dropped to an average of $55 billion per year. The report speculates that Trump’s re-election could intensify these trends, promoting a faster shift from US Treasuries to alternative financial assets such as Bitcoin and gold. The report also discussed Bitcoin in comparison to gold, positioning the flagship crypto as a non-traditional financial asset with similarities to how gold functions as a hedge. It explained that Bitcoin, like gold, tends to perform well as a hedge against traditional financial assets during times of banking stress or when central banks engage in significant monetary expansion. For example, the price of Bitcoin rose by $10,000 following the collapse of Silicon Valley Bank in March 2023, showcasing its ability to act as a safe haven during financial crises. However, the report also noted a key difference between Bitcoin and gold — BTC does not perform as well during periods of heightened geopolitical risk, unlike gold, which traditionally maintains or increases its value during such times. The report partly attributed the difference to Bitcoin’s role as an extension of the tech sector, which can be more volatile and sensitive to global tensions.",
  "date": "2024-05-08T19:30:16+00:00",
  "tags": "",
  "author": "Assad Jafri",
  "category": "Bitcoin, Analysis, Crypto, Featured, Price Watch"
}
,{
  "link": "https://cryptoslate.com/us-lawmakers-introduce-bill-to-suspend-crypto-mixer-transactions/",
  "websiteSource": "CryptoSlate",
  "type": "article",
  "summary": "",
  "title": "US lawmakers introduce bill to suspend crypto mixer transactions",
  "detailedContent": "US lawmakers have proposed a new bill that aims to temporarily prevent financial institutions from engaging in transactions involving funds that have been through crypto mixers. Congressman Sean Casten (IL-06) introduced the bill on May 7 and received support from Representatives Bill Foster, Brad Sherman, and Emmanuel Cleaver. The proposed legislation, dubbed the Blockchain Integrity Act, seeks to impose a two-year moratorium on financial institutions, such as crypto exchanges, virtual asset service providers (VASPs), and other registered money service businesses (MSBs), from accepting incoming funds routed through a mixer. It also aims to bar outgoing funds from being withdrawn directly to a known mixer address. During this period, the bill mandates the Treasury Department, SEC, CFTC, and DOJ to conduct a comprehensive study on digital asset mixers, privacy coins, and anonymity-enhancing technologies. This study includes analyzing statistics on their illicit uses, insights into legitimate applications, and crafting tailored legislative suggestions to counter illegal activities by specific perpetrators. A crypto mixer is a service used to “mix” diverse crypto funds with others to obscure their origin. Typically, this involves pooling source funds from various inputs over an extended random period before redistributing them to destination addresses. Congressman Casten expressed the opinion that digital asset mixers should be treated as potential tools for money laundering unless subjected to rigorous audits. He claimed that digital assets have been used to finance terrorist activities globally in recent years, adding that: Similarly, Congressman Foster emphasized that mixers enable malicious actors to perpetrate financial crimes undermining US security. Meanwhile, Congressman Sherman noted mixers aid in achieving crypto’s objective of facilitating concealed transactions. Notably, this bill emerges amidst heightened scrutiny by US authorities on mixers, alleging that these privacy-enhancing services facilitate illicit financial activities.",
  "date": "",
  "tags": "",
  "author": "Oluwapelumi Adejumo",
  "category": "US, Featured, Regulation"
}
,{
  "link": "https://cryptoslate.com/polkadot-rolls-out-asynchronous-backing-to-boost-network-efficiency-and-transaction-speed/",
  "websiteSource": "CryptoSlate",
  "type": "article",
  "summary": "",
  "title": "Polkadot rolls out asynchronous backing to boost network efficiency and transaction speed",
  "detailedContent": "Polkadot has implemented asynchronous backing, a pivotal upgrade enhancing the network’s flexibility in blockspace allocation and overall performance. The upgrade is one of the three technological advancements, alongside Elastic Scaling and Agile Coretime, driving the blockchain towards its Polkadot 2.0 vision. Asynchronous Backing According to Polkadot, asynchronous backing provides an optimized approach for validating parachain blocks by its relay chain. The blockchain said the upgrade would introduce a twofold acceleration in blockspace production time and a 3-5x increase in extrinsic per block. It would also lead to heightened utilization of parachain blocks and is projected to enhance blockspace availability by 6-10x. Furthermore, asynchronous backing would also result in an 8-fold increase in throughput while upholding security standards. This enhancement is expected to support decentralized applications, catering to diverse sectors like Web3 gaming and DeFi. PolkaWorld, a social media account focused on the Polkadot network, further explained: Polkadot’s asynchronous support didn’t significantly affect DOT’s price, which experienced a slight 1.16% decline in the last 24 hours, settling at $7.06 at press time, according to CryptoSlate’s data. This represents a reversal of fortunes for a digital asset whose value had increased by around 10% during the past week amid a broader market performance. Notably, crypto analyst Michaël van de Poppe recently described Polkadot as one of the leading layer1 networks still heavily undervalued. According to him:",
  "date": "2024-05-08T16:58:32+00:00",
  "tags": "",
  "author": "Oluwapelumi Adejumo",
  "category": "Polkadot, Technology, Tokens"
}
,